{
  "source": "qaam-cama_removed.pdf",
  "num_pages": 72,
  "pages": [
    {
      "page": 1,
      "text": "Progetto e coordinamento scientifico: Annarita Puglielli\nMadaxda Tifaftirayaasha:\nAnnarita Puglielli, Cabdalla Cumar Mansuur\nGuddiga Cilmibaarista:\nAnnarita Puglielli, Axmed Cabdullaahi Axmed, Cabdalla Cumar Mansuur, Ciise Maxamed Siyaad, Axmed Cartan Xaange, Maryan Faarax Warsame, Dahabo Faarax Xasan, Cabdi Daahir Afey\nTifaftirayaasha:\nAxmed Muuse Kayd, Cabdullaahi Maxamed Shirwac, Maxamed Cilmi Toxow, Cumar Maxamed Siyaad, Ibraahim Nuur Faqaburaale, Xasan Ibraahim Macallin, Cabdi Daahir Afey, Cabdullahi Xasan Rooble, Axmed Cabdikariim Xirsi, Amiin Maxamed Cali, Maxamed Soofe Xasan, Daahir Cali Cumar, Saciid Cusmaan Keenadiid, Aw Jaamac Cumar Ciise, Cali Axmed ‘Mudiir’, Axmed Xasan Axmed\nAqoonyahannada aan ka helnay wadashaqayn:\nRoberto Ajello, Giorgio Banti\nElaborazione dati ed impaginazione:Renato Moretti – Centro Linguistico di Ateneo\nCoordinamento editoriale:\nGruppo di Lavoro\nRoma TRE-P REss\nEdizioni: Roma TRE-P REss ©\nRoma 2012ISBN: 978-88-97524-02-1\nhttp://www.romatrepress.uniroma3.it"
    },
    {
      "page": 2,
      "text": "T usmada Buugga\nGogoldhig V\nEreyada la isku gaabiyay XXI\nQaamuuska 1\nNaxwaha af-soomaaliga oo kooban 895\nShaxannada 921"
    },
    {
      "page": 3,
      "text": ""
    },
    {
      "page": 4,
      "text": "V Gogoldhig\n\nQaamuuskani waa mirihii hawl adag oo muddo dheer soo socotay. In uu\nmudadaas dheer qaato waxaa ugu wacan maadaama uu qayb ka ahaa sababihii\nloo sameeyey mashruuca Cilmibaari sta Soomaaliyeed (Studi Somali)1, waxaa\nhawlgalkiisu billaabmay kaddib markii la soo saaray sannadka 1985\nQaamuuska Soomaali-Talyaani  (Agostini F., A. Puglie lli e Ciise M. Siyaad,\nDizionario Somalo-Italiano, Roma, 1985);  sababta ay hawsh iisu u adkaatayna\nwaxay ahayd iyadoo billow gii dagaalka sokeeye ee 1991 uu caqabad ku\nnoqday sii wadidda hawshi i qiimaha lahayd ee la gu qabtay Akademiyadii\nFanka, Suugaanta iyo Sayni ska ee Muqdisho. Waxaase nasiib wanaag ah in\ndalka Taliyaanig a ay yaaleen nuqu lladii macluumaadkaas oo laga\nshaqeeynayey ilaa muddadaas. Inkastoo qa ybo ka mid ah oo  aan nuqulkooda\nla haynini ay ku baaba’een Soomaaliya, intooda badani way badabaadeen. Joogsiga mashruuca iskaashiga “Som alia-Italia” iyo bu rburkii ku dhacay\nJaamacaddii Ummadda Soomaaliyeed iyo Akedemiyadii, sida hay’adaha kale ee qaranka, iyo guud ahaan xaaladihii colaadeed ee dalka ka jiray waxay sababeen in dib u ha bayn xoog leh lagu sameeyo mashruuca qaamuuska.\nArrintan iyada ah dhowr je er ayaan horay uga faall oonay (Puglielli 1995,\nPuglielli e Bitocchi 2009)\n2.\nWaxaa noo suurtaggeli wayday in wa xyaabo aan ku taamaynay in aan si\nfiican ugu falanqayno qaybo gaar ah, sida: ereyada  farsamada, aqoonta dhirta\niyo xoolaha iyo kuwa kale, sidaas ay tahay arrima haas nagama horjoogsanin\ndhamaystirka hab daabacaad da qaamuuskan oo aan maan ta u soo bandhigayno\n\n  1Mashruuca Cilmibaarista Soomaaliyeed, oo la bilaabay sannadka 1977-78, wuxuu ka mid\nnoqday mashaariic cilmi-afeed oo lagu hormarinayey iskaashiga dhex yiil Talyaaniga iyo\nSoomaalida, gaar ahaan Wasaaradda Arrimaha Dibadda ee Talyaaniga iyo Jaamacadda\nUmmadda Soomaaliyeed ee Muqdisho (AAVV, Atti dei Convegni Lincei 107, Lingua,\npensiero scientifico e interculturalità: l’esperi enza dell’interazione universitaria in Somalia ,\nRoma, Accademia Nazionale dei Lincei, 1994.)Mashaaricdaas hadafkoodu kuma ekayn keliyah in la hagaajiyo habka loo baro ardayda af talyaaniga si ay ugu suurtowdo in ay af taliyaaniga ku\nbartaan maadooyinka looga dhigo kulliyadaha kala duwan ee Jaamacadda, wuxuu kaloo yoolkiisi ahaa in si cilmiyeysan loo baaro af-soomaaliga xagga codayntiisa, dhismihiisa iyo\nereyadiisaba, afkaanoo ah mid dhawaan loo yeelay far-qoraal, noqdayn afka rasmiga ee\nqaranka soomaaliyeed (Abdalla O. Mansur Il somalo dalla oralità alla scrittura, in Atti dei\nconvegni Lincei 107 ,1994).\n\n2Puglielli A., The Somali Language Lexical Project: Aims and Methods  in M. Putz (ed.)\nDiscrimination through Language in Africa, Berlin-New York,Mouton de Gruyter, 1995.\n   Puglielli A. e F. Bitocchi, Qaamuuska Af-Soomaaliga . The Great Somali monolingual\nDictionary , in A.  Puglielli , (ed.), Lessons in survival: the language and culture of\nSomalia.Thirty years of Somali studies. Studi Somali 13, Torino, Harmattan Italia, 2009.\n"
    },
    {
      "page": 5,
      "text": "VI guud ahaan aqoonyahannada, gaar ahaana bulshada soomaaliyeed ee ku nool\ngudaha dalka soomaa liyeed ama dibaddiisaba, annagoo aaminsan in luqaddu\nay matasho shayga ugu muhimsan ee  ummad lagu aqo onsado (identity),\nqaamuusna uu yahay waxa lagama maarmaanka u ah ad eegsiga luqadda\n(Puglielli 2001)3.\nQaamuuskan, dabcan ma aha mid ma talaya heerka kamadambeyska ah\nee loo sameeyn karo qaamuus af-soomaal i, laakiin waxaan f i l a y n a a  i n  u u\nnoqdo mid si wacan looga faa’idaysan karo must aqbalka xagga diyaarinta\nqaamuusyo midkan ka baaxad  weyn. Si kastaba ha ah aatee, qaamuuskan halka\nluqadeed qaabkiisa, markii laga ee go xagga daraasaadka guud ee afafka\nAfrikada madow, waxaa la oran karaa in  uu ka mid yahay qaamuusyada fara\nku tiriska ah.\nDhowr jeer ayaan ka ha dalnay habka aan u ad eegsannay diyaariinta\nQaamuuskii hore Soomaali-Talyaani  (DSI) oo ereyadiisii aasaaska u yihiin\nqaamuuskan iyo sida aan ugu hawlgalnay  ballaarinta micnaha iyo ereyada\nmacluumaadka kala duwan. Sidaa dartee d waxaa keliya aan halkan ku soo\nbandhigaynaa raadraacyada si ay uga faa’idaysato ciddii  doonaysay in sii\nbaarto mawduuca.  Waxaan doonaynaa in aan halkan ku soo bandhigno wi xii wargelin ah\noo dhan oo lagama maarmaanka u ah sidi i wax badan looga faa’idaysan lahaa\nqaaamuuskan muhimka ah, inkastoo uu dald aloolo lahaan karo, waxaanna ku\nrajaweynnahay in ay ka faa’idaysan karaan dadka hawlahan u dhuundaloola,\naqoonyahannada iyo dadweyne fara badan iyo xataa dugsiya da soomaaliyeed\nmarkii dib loo dhiso.\n1. Taariikh kooban oo ku saabsan qaamuuska\n\nEreyada aasaasiga ah ee lagu b illaabay qaamuuskan waxay ahaayeen\nereyadii qaamuuska soomaali-talyaani  (DSI) oo la daab cay sannadkii 1985.\nEreyadaas tiradoodu waxay ahaayeen qiyaastii 30.000 oo lagu soo xulay baaris\nlagu sameeyey qaamuusyadii markaa jira y oo idil oo ay ku saabsanaayeen af-\nsoomaaliga oo lagu tarjum ay af kale, laga billa abo midkii uu Reinisch\nsameeyey sannadkii 19 02, iyo qaamuuska keliya ee hal af ku qoran ee markaas\njiray oo ah midkii Yaas iin Cusmaan Keenadiid\n4 oo qiyaastii ka kooban 15.000\n\n3Puglielli A .,Language and identity, in  Lilius M.S. (ed.) Variations on the theme of Somaliness,\nTurku, Center for Continuing Education, Abo Accademy University, 2001.\n4Yaasiin C. Keenadiid, Qaamuuska Af-Soomaaliga, Firenze, 1976.\n\n"
    },
    {
      "page": 6,
      "text": "VII erey, intaa waxaa sii dhee r ereyadii ka soo baxay lafagurkii lagu sameeyey\nqoraallo fara badan oo af-soom aaliga lagu qoray laga billaabo sannadkii 1972.\nHaddaba hawshu waxay ku billaabatay in af-soom aali ahaan lagu qeexo\nmicnaha ereyada ku qoran qaamuuska DSI iyadoo la raacayo qaacido iyo\nnidaam ay degsadeen cilmibaarayaal ka  kooban talyaani iy o soomaali oo ka\nmid ahaayeen xubnaha mashruucaas. Waxaa kuwaas lagu sii kordhiyay markii\ndambe ereyo kale oo meelo kala duwan laga keenay, ha ahaa deen isla ereyadii\nmarkaas la hayay kuwa la micna ah am a ha ahaadeen ereyada ku saabsan\nkasmada, farsamada iyo cilmiga oo mark aas loo baahnaa in loo adeegsado dib\nu habeynta buugaagta dugs iyada, waxaana lagu dhaqa aqay in la soo xulo\nereyada aasasiga ee u gaarka ah maadda walba (xisaabta, fiis ikiska, taariikhda\niwm.). Eereyadaas iyo micnahooda oo soomaali ah waxa a soo diyaariyey\nXafiiskii  Manaahijta ee Wasaaraddii Wa xbarashada, xilligaasuna waa\ndhammaadkii 80meeyadii5.\nTaariikhdan kooban waxaan ku s oo gunaanadaynaa in aan idin\nxasuusinno dhammaan dadka siyaabo ka la duwan iyo muddo kala duwan ay\nuga qaybqaateen hirgelin t a  m a s h r u u c a n  l a g a  b illaabo 1985tii. Inkastoo\nqaarkood ay geeriyood een weli xasuustayada kama suulin.\nLiiskani waa magacyadii da dka taabbaggeliyay hawshan.\n\nGuddiga Cilmibaarista :\nAnnarita Puglielli, Axmed Cabdullaah i Axmed, Cabdalla Cumar Mansuur,\nCiise Maxamed Siyaad, Axmed Cartan Xaange, Maryan Faarax Warsame, Dahabo Faarax Xasan, Cabdi Daahir Afey.\nTifaftirayaasha:\nCabdalla Cumar Mansuur, Axmed Muuse Kayd, Cabdu llaahi Maxamed\nShirwac, Maxamed Cilmi Toxow, Cuma r Maxamed Siyaad, Ibraahim Nuur\nFaqaburaale, Xasan Ibraah im Macallin, Cabdi Daahir Afey, Cabdullahi Xasan\nRooble, Axmed Cabdikariim Xirsi,  Axmed Xasan Axmed, Amiin Maxamed\nCali, Maxamed Soofe Xasan, Daahir Cali Cumar, Saciid Cusmaan Keenadiid,\nAw Jaamac Cumar Ciise, Cali Axmed ‘Mudiir’.\nWaxaa kaloo xusuus mudan gacanta aan ka helnay shaqaalahii Xafiiska\nManaahijta oo nasiib darro magacyadooda aan waynay meel aan u raacno.\nAqoonyahannada aan ka helnay wadashaqayn:\nRoberto Ajello, Giorgio Banti.\n\n\n5Arrintan oo tifaftiran waxaa laga heli karaa qor aalkii. Puglielli A. iyo F. Bitocchi (2009).\n"
    },
    {
      "page": 7,
      "text": "VIII 2. Habka uu u samaysanyahay qaamuusku\n\nWaxaa halkaan ku so o bandhigaynaa warbixinno fududeynaya la\ntashiga ama adeegsiga Qaamuuska.\nErey kasta ee ka mid ah qaamuuskan oo la fasiray wuxuu leeyahay arrimaha\nama qaybaha soo socda oo la xariira sharraxaadda ereyga:\na) Ereyga soomaaliyeed  ee la fasirayo\nb) Qaybta naxweed ee uu ereygaasi ka tirsanyahay\nc) Tilmaan muujinayso  rogrogmadka eryga marka uu yahay fal ama magac.\nd) Qeexidda micnaha ereyga\ne) Erey la mid ah ama la mi cna ah ereyga la fasirayo6\nSi loo muujiyo sida ay is ugu xigaan waxyaabaha loo adeegsaday sharraxaadda\neryga waxaa tusaale ahaan u soo qaadanaynaa ereyga falki oo raacsan afar\nqaybood oo la xiriira fasiraaddiisa:\n ereyga  qaabnax. isro grogga micnaha  lamidka\nfalki  f.g2  (-iyay, -isay) falko samayn;  falag2\n Qaybahan warkooda oo f aahfaahsan waxaa ku cad qodobbada s oo socda,\nxagga dambe ee qaamuuskana waxaa ku lifaaqan “Naxwaha af-soomaaliga oo\nkooban” oo loogu talagg aly in uu sii faahfaahiyo wixi i war ah ee aan halkan ku\ncaddayn.\n2.1 Ereyada qaamuuska iyo nidaamka loo taxay\n\nIsku xigga xarfaha ku billaabma ereyada la micneeynaayo waxaan u\ndoorannay habka uu Yaasii n Cusmaan Keenadiid u ad eegsaday qaamuuskiisa,\nyacnii habka iskux igga alifba’da Laa tiinka, sababaha aa n u doorannayna labo\narrimood ayaa ugu muhimsan:\na) Maadaama ummadaha badan ee fart oodu tahay midda Laatiinka ay\nqaamuusyadooda si isku mi d ah u adeegsadee n habka isku xigga alifba’da,\nwaxaan doorbidnay in qaamuuska af-soomaaligu na uusan ka duwanaan\nhabkaas caalamiga ah.\nb) Maadaama shaqallada af-soomaaligu ay  leeyihii xarfo u gaar ah sida\nshibbanayaasha waxaa nala habboonaatay  inaan laga soocin shibanayaasha,\nyacnii in meel gooni ah lagu taxo ereyada ku bilaab ma shaqallada waa laga\nfiicanyahay, gaar ahaan marka qaamuus la samaynaayo.\n\n6 Ereyga la midka ah erey kale (varient) isna gooni ayaa loo qoray, laakiin halka lagu qori lahaa\nqeexidda micnihiisa waxaa ku qoran oo keliyah ereyga la micnaha ah, kaasoo loola jeedo\n“ereygan micnihiisa ka eeg midkan kale e la midka ah (ld)”.\n"
    },
    {
      "page": 8,
      "text": "IX Waa kan habka isku xigga alifba’da ee qaamuuskan:\n\n A, b, c, d, e, f, g, h, i, j, k, l, m, n, o, q, r, s, t,  u, w, x, y.\n\nXarfaha dh, kh, sh ereyadooda gooni uma qorna, waxay ku kala  jiraan halka ay\nkaga aaddanyihiin taxanaha xarfaha d-, k-, s-, habkaanna afafka kale ayay la\nwadaagaan, sida “sh-”-da af ingiriisga oo laga dhex helo halka ay kaga\naadantahay ereyada ka bilaabma xarafka “s-”. Ereyada qaamuuskan waxaa loo adeegsaday far-soomaaliga rasmiga ah oo aan\nwax laga beddelin, laakii n mararka qaarkood ayaan u baahannay in aan ku\nkordhinno calaamo yar  si aan u kala saarno ereyada qaabkooda qor aalku isku\nmidka yahay micnahooduse ay kala duw anyihiin, waxaana lagu kala saari\nkaraa oo keliya shaqalka ay wadaagaan oo laba siyood loogu dhawaaqo. Sida\naad ku arki doontaan qaybta dambe ee qaamuuska “Naxwaha af-soomaaliga\noo kooban”, shaqal walba labo siyood oo kala duwan ayaa loogu dhawaaqaa:\nmar waa culusyahay, marna waa fu dudyahay, sida labadan erey:\n\ndųul² f.mg1 (-uulay, -uushay) Dad ba dan in ay dagaal qaadaan u bixid\nduul²  f.mg1 (-uulay, -uus hay) 1. Diyaarad, shimbi r iwm hawada dhexdeeda\nmarid. 2. Diyaar ad iwm ku safrid\n\nEreyga hore wuxuu leeyahay shaqal culus, sidaa darteed shaqalka “ ųu”\nhoostiisa waxaa ku astaysan calaamad yar. Ujeeddadu ma aha in aan wax ku\nkordhinayno alifba’da soom aaliyeed, laakiin waa si loo fududeeyo kala\ngarashada labada erey ee noocaan oo kale ah oo aan ay ku dhex jirin weero laga\ndheehan karo micnahooda.\n\n2.2 Ereyada qaabkoodu isku midka yahay\n\nLaba erey ama in kabada n oo qaab ahaan isku si l oo qoro laakiin ay ka\nkala duwanyihiin naxwa ahaan iyo mi cna ahaanba waxaa la kala siiyaa\nlambaro isku xiga: magacyada ayaa la hormariyaa, falalka ayaa lagu xijiyaa,\nkaddibna qaybaha kale ee ereyada, magacyadana kuwa labka ayaa laga\nhormariyaa kuwa dheddigga.Tus.\n\nbeer¹  m.l (-rar, m.l) 1. Xubin uurkuj irta ah lafdhabarle yda ka mid ah\nmidabkeedu madow guduud ku dheehanyahay ah oo samaysa xammeetida, dhiiggana wixii sumeynaya ka ilaalisa. 2. Qaybta dhexe ee miraha jilicsan,\nqolof ku dahaaran oo uu geedku ka  dhasho ."
    },
    {
      "page": 9,
      "text": "X beer²  m.dh (-ro, m.l) Dhul la falay oo dhir, miro, badar iwm lagu  abuuri\nkaro.\nbeer³  f.g1 (-ray, -rtay) 1. Dhul miro ku abuurid. 2. Ku b.: dareen gaar ah ku\nabuurid (qof).\n\n2.3 Ereyga iyo qeexidda micnihiisa\n\nEreyada micnahooda, oo qaarkood ay la socdaan tusa alooyin, waa la\nsoo koobay markii laga reebo ereyada cilmiga la xiri ira oo qaarkood si gaar ah\nloo faahfaahiyay, gaar ahaan kuwa af-soomaaliga ku cusub. Ereyadan\nmicnahooda, sida aa n korba ku soo xusnay, waxaa ka shaqeeyey qeexiddooda\naqoonyahanno ka shaqayn jiray Xafiiskii Manaahijta ee Wasaaraddii\nWaxbarashada. Waa laga yaaba in qaar kood ay leeyihiin da ldaloolo, laakiin\nulajeeddadayadu waxa y tahay in ay noqdaan kuwa laga ambaqaadi karo ama\nay ka shidaal qaataan dadka doonaya in ay diyaariyaan qaamuus cilmiyeed ama\nay abuuraan ereybixinno loo adeegsad o diyaarinta buugaa gta dugsiyada.\nBillawga qeexidda ereyga waxaa ku yaalla laba bil oo dhexdooda uu ku qoran\nyahay magaca maaddada oo la  soo gaabiyey, sida ( daaw .) = Daawo , (fiis.) =\nfiisikis . Xitaa magacyadan i yo qaabkooda gaaban waxa a laga dhex helayaa\ntaxanaha ereyada la soo gaabiyey. Waxaan tusaale ahaan halkan ku xusaynaa\nerey cilmiyeed iyo micnihiisa:\nfalnaq  m.l  (daaw.) Hawl uu fu liyo, ogaan la'aan, xiriir ka ugu fudud ee unug\nmaskaxeed iyo muruq. Sida as darteed dareenka x annunka leh sida irbad\nmudid waxay keeneysaa dhaq aaq deg-deg ah oo faraha   lala boodo inta\nmaskaxdu ayan amar u soo diri n muruqii ay saameysay.\n\nHaddii erey uu leeyahay hal micne wa x ka badan hal mar uun baa la qoraa\nereygaas, micna kasta ee uu leeyahayna er eygaas lambar ayaa la siiyay, sida\nereygan:\n\nbaar m.l 1. Fiidda sare ee geed ama timo iwm. 2. Dhogor d haadheer ah oo ka\nbaxda kuruska geela dushii sa. 3. Ciyaarta daba-ka- eriga, hal ma r oo turubka\nla qeybiyo laguna ciyaaro. 4. Isha baalkeeda. 5. (-rar, m.l) Meel lagu iibsho\ncabitaanka iyo cunto fudud.\n\nWaxaa la arkaa mararka qa arkood erey ay soomaali du micne kala duwan u\ntaqaanno, yacnii erey micn ihiisa sida gobollada woqoo yi looga yaqaan si ka\nduwan ayaa gobollada koonfureed looga yaqaannaa. Hadaba , ereyga noocaas\noo kale ah waxaa la  siiyey labadiisa micne ee kala duwan, sida ereygan:"
    },
    {
      "page": 10,
      "text": "XI\niskadhal  m.kh 1. I. ah: qof l abadiisa waalid aysan isku  jiinsiyad ahayn. 2. I.\nah: qof labadiisa waalid ay isku qoys yihiin.\n\n2.4 Ereyada isku micnaha leh (variant)\n\nEreyada micna ahaan isku midka ah laakiin yara kala duwan\nqoraalkooda waxaa loo qo ray iyadoo la raacayo nidaamka soo socda:\na) Haddii ereygu uu leeyahay hal micno oo keliyah er eyga la midka ah (ld)\nwaxaa la dhigaa meesha ugu dambaysa qeexidda micnahaas, sida eryga\nfalki aan kor ugu soo aragnay.\n\nfalki f.g2 (-iyay, -isay)  Falko samayn. ld falag 2\n\nb) Haddiise ereygu uu leeyahay  in ka badan hal micn o oo ereyga la midka\nahina uu la wadaago hal micno oo keliyah, inta kalena aan la wadaagin,\nwaxaa ereyga la midka ah loo yeela lambar gaar ah. Tus.:\n\nbariido m.dh 1. Casho baartay oo maalintii xigtay gaartay. 2.  ld  bariidin:\nSalaanta kolka waagu beryo.  3. Hanti laga bixiyo gabar guur laga doonayo\noo la siiyo soddohda.\nbidhaan  m.l 1. Muuqaal meel fog laga arko. 2. Tiro aad u yar oo ari ah\noo gaar u daaqa. 3. ld  bidhaamid .\n\nc) Haddii ereyga la midka ahi uu la wad aago ereyga la fasi rayo inta micno ee\nuu leeyaahy oo dhan, waxaa ereyga la midka ah ( ld) lagu qoray\ndhammaadka qeexidda micn aha ugu damb eeya. Tus.:\n\nfoof¹ m.l 1. Xoolo daaq doonad ah. 2. Meesha xooluhu daaqaan. 3. Inta u\ndhexeysa xerada iyo daaqsinta. 4. Kadin geel ah. 5. Daaq. 6. ld foofid. ld\nsoof.¹\n\nd) Maadaama af-soomaaligu, qoraal ahaan,  aanu weli si fiican u wada\nmidoobin, waxaa ku badan ereyo isku mid ah, laakiin soomaalida ku kala\nnool gobollada qaarkood ay ugu dhawaaqaan amaba u qoraan siyaabo yara\nkal duwan. Haddaba si aan cidna loo gu eexanin waxaan isku daynay inaan\nku qorno qaamuuska kuwa adeegsi gooda aadka ugu badanyihiin, sida\nkuwa soo socda oo laba qaab loo adeegsado:\n\ntabar tamar"
    },
    {
      "page": 11,
      "text": "XII baratami bedertami\nquraanyo quraanjo tallaabo tillaabo dhifasho dhufasho dhacaan dheecaan necbaan nebcaan ningax lingax siyaaso siyaasad dayuuro diyaarad\niwm\n\nEreyadan kor ku xusan, oo mid waliba leh mid la mid ah, iyo wixii la\nhalmaalaba waa la qoray, mid baase la micneeyey, midka kalena waxaa\nkeliya oo horiisa lagu qoray ld. (la mid ah) iyo ereyga kale ee la micneeyey\noo loola danleeyahay “micnihiisa ka raadi ereygaa kale ee la midka ah”. Tus.\n\nquraanyo  m.dh.u, Cayayaan yaryar jaadad badan, beelbeel u degta oo\naan baalal lahayn, lehn a lix addin iyo l abo gees; quraanjo.\nquraanjo  m.dh.u, ld quraanyo .\n\ne) Qaar ka mid ah eryada isku midka  ah oo dhigaalkood u uu kala yara\nduwanyahay ayaa ogaal ahaan ama ul akac looga tagay, maadaama aanay\nwax faa’ida ah ku soo kor dhinaynin qaamuska culays mooyee. Labada\nerey ee isku midka ah oo labadoodaba caadi ahaan  la adeegsado mid uun\nbaa laga doortay, ka asoo inta badan qoraal ahaa n adeegsigiisu badanyahay.\nEreyadaas labada dhawaaq ee kala du wan leh waxaa ka mid ah kuwa kala\nleh xarfahan kala duwan ee soo socda:\n\n-rn- (furnay) - rr- (furray)\n-i/a/y+snaa  (ducaysnaa )-i/a/y+sanaa  (ducaysanaa )\n-ln- (dilney) -ll - (dilley)\n-a- (hawl) - o- (howl)\n-a- (gabar) - e\n- (geber)\nq- (qalad) kh- (kh alad)\n-ng- (hingo) - gg- (higgo)\n-iy- (u kaadiy ey) - sh- (u kaad shay)\n-r- (ma ji rto) - dh- (ma ji dho)\n-ey (erey) - ay (eray)\n-ay (kariy ay) - ey (kariy ey)\n"
    },
    {
      "page": 12,
      "text": "XIII Ereyada leh xarfaha ku taxan safka bidix, oo n tusaale ahaan u soo\nqaadannay ereyo qaarko od, ayaa ah kuwa ku qoran qaamuuskan, xarfaha\ntaxanaha kale ee midig waa kuwa la midka ah ee aan ku xusnayn halkan. Taas\nwaxay la micna tahay, hadd ii aan tusaale ah aan u soo qaadanno, in erey kasta\nee ka mid ah qaamuuskan oo xarfihiisa ka mid ah – rn oo isku xigaan, waxaa\nsuurtaggal ah in uu jiro erey la mid ah  oo labadaa xaraf ka  dhigaya qaabkan –\nrr. Labada cod ee ugu dameeya ey iyo ay waa la wada adeegsaday inkastoo\nlabadooduba ay leeyihiin kuwa u dhigma oo la  midka ah: ay iyo ey. Arrintan\ngo’aankeeda waxaan qaadannay kaddib markii aan la ta shannay odayaashii\nsoomaaliyeed ee gacanta weyn naga  siiyey diyaarin ta qaamuuskan.\n\n3. Sifaynta erey naxweydyada kala duwan\n\nHalkan waxaan ku xusa ynaa oo keliya magacyada erey naxweydyada\nugu muhimsan, laakiin qayb ta “Naxwaha af-soomaaliga oo kooban” ayaan si\nfaahfaahsan oo tusalooyin  leh ugu qaadaa dhignay. In kastoo magacyada\nereyada naxweed oo dhan iyo qaabkood a la soo gaabiyay ay ku xusanyihiin\nmeel gaar ah, waa kuwa n qaarkood: magac (magac lab, magac dheddig), fal\n(fal-gudbe, fal-magudbe, fal-labagudbe), magacuya al, magac faleed, magac\nkhabareed, tilmaame, qur ub (diiradeeye, xiriir iye, horyaale iwm).\nWaxaa halkan laga dareemayaa in si fadu ay ka maqantahay taxanaha\nmagacyada erey naxweedyada kor ku xus an. Sida aqoonyah anka Adrzejewski\nuu ku taliyay, waxaanu ka  dhignay ereyada sida: weyn, yar iwm koox faleed\ngaar ah oo ka baxsan kuwa caadiga ah, waxaanna ku magacaabnay kooxda\nisrogrogga IV ama fal-sifo. Arrintaanna bib b aan uga faalloon doonnaa.\n 3.1 Falalka\n\nEreyada falka looma qorin qaabka  ay soomaalidu caada ahaan u\nadeegsato sida cunid, karin, barasho iwm, laakiin qaabka fal amarka ayuu u\nmuuqdaa sida cun, kari, baro, qaabkaasoo ah salka falk a, ahna qaybta asalka\nah oo lagu kabo lifaaqyada muujinay a amminka (tense),  xaaladda (mood)\niwm. Qaabkani waa nidaamka ay aad u adeegsadaan cilmi-afeedyahannada ku\nxeeldheer baarista af-soomaaliga iyo xitaa kuwa baara afafka kale ee\nKushitigga. Ereyga falka ag tiisa, fasiraadda micnaha ka hore, waxa a laba bil\ndhexdooda ku qoran fa lkaas lifaaqiisa qofka 3d ee kelida ee lab iyo dheddig\n*ah, amminkiisuna yahay qaab  tagto habkeeda ebyoon. Tus.\n"
    },
    {
      "page": 13,
      "text": "XIV cun f.g1(-ay, -tay) 1. Cunto quudasho. 2. Qaniinyo wax ku yeelid. 3.\nCayayaan, nafle dhiig ka ja qid. 4. Cid il wax ku yeelid . 5. Ciyaar turub haad,\nhaad kale oo ka adag ku qaadasho.\n\nQaabka fal-saleedka wax aa loo adeegsaday xataa fa lal aan caadi ahaan loo\nadeegsanin fal amar ahaan, habkan xita a afaf kale ayaa loo adeegsaday falal\naan lahayn qaab amar, sida falalka soomaaliyeed: aqoo, yaal, weynow iwm .\nFalalku, guud ahaan, laba kooxood ayay u kalal baxaan: fal-gudbe (f.g) iyo fal-\nmagudbe (f.mg) , hase ahaatee waxaa jira fala l loo adeegsan karo labada\nqaabba, yacnii fal-gudbe  ahaan iyo fal-magudbe  ahaanba (f.g/mg ). Falkaas oo\nkale inta laba jeer la qori lahaa mar uun baa la qo ray, labada siyood ee loo\nadeegsadana sharraxaadda micnah a ayay ka dhex  muuqdaan. Tus.\n\nbaro (f.g/mg3) 1. (f.g) Aq oon kororsasho. 2.(f.mg ) U b.: wax caado ka\nyeelasho. Tus. \"Cali in  uu subax walba canjeero  cuno ayuu u bartay\".\n\nWaxaa jira fal uu  isku hayn karo horyaale  (preposition) la’aan saddex magac,\nyacnii yeele iyo laba magac kale aan yeele ahayn. Tusaale ahaan, haddaan u fiirsanno weertan “Cali ayaa guriga tusay Axmed”  waxaan arkayn aa in falka\ntus uu isku hayo yeelaha ( Cali) iyo labada layeele ( guriga iyo Axmed ) isagoon\nu baahnayn horyaale. Falka caynkan oo kale ah waxaa lagu magacaabaa fal-\nlabagudbe (f.lg).  Tus.:\n\ntus² (f.lg1) 1. Cid wax fart a ugu fiiqid. 2. Is t.: laba qof isu keenid.\n\n Guud ahaan waxaa jira afar siyood oo falalaka soomaaliyeed ay isu\nrogrogaan. Si hogatus ah ayaan halkan ugu s oo bandhigaynaa si da afarta qaab\nisrogrog (conugas ion) ee fal-saleed yadu ay uga dhex muuqdaan ereyada\nqaamuuska. Afartaa hab isrogrog sharraxaaddood a oo koobani waxay ku\nxusanyihiin qaybta “Nax waha af-soomaaliga oo kooban” oo ku qor an xagga\ndambe ee qaamuuska, waxaa kaloo halkaas lifaaq ahaan ugu qoran dhowr shaxan iyo tusaalooyin oo faahfaahinaya afarta hab ee isrogrogga falka oo kaamil ah.\nIsrogrogga I:\n\nWaxyaabaha u gaarka ah qaabka isrogrogga I:\n1) Qaabkan waxaa ka tirsan falalka qaabkooda fal amar  ee kelida ah oo aan\nlahayn dibkabe isrogroga.\n2) Dibkabaha tagtada qofka 3° ee kelida ah: -ay (l.), – tay/-day  (dh.)"
    },
    {
      "page": 14,
      "text": "XV 3) Dibkabaha masdarka  (infinitive) – i\nTus.:\ncun f.g1 (-nay, -ntay)\n 1) Cun! 2) cun ay, cuntay  3) cun i (doona)\nqor f.g1 (-ay, -rtay)\n 1) Qor!   2) qor ay, qortay 3) qor i (doonaa)\n\nWaxaa kaloo ka mid ah qaybta isrogr ogga 1° falal farc ame oo qaababkooda\namareed leh dibkabeyaal,  sida kuwa soo socda.\n\na) gabow ² f.mg1  (-oobay, -o wday; -oobi)\n1. gab ow  2. gaboobay , gab owday   3. gab oobi\nb) xiran ¹ f.mg1  (-rmay, -rantay; -rmi )\n1. xiran   2 . xirmay, xirantay  3. xirmi (doonaa )\nc) bari³ f.mg1  (-ryay, -riday; -ryi )\n1. bar i  2. bariyay, bari day 3. baryi (doonaa )\n\nWaxaa qaamuuska laga dhax  arkayaa in falalka qa arkood, halka ku cadyahay\nisrorogga, la raacsiyey qaabka uu ku dhammaado masdarka oo wax yar ka beddelan sida caadiga ah, arrintaasna waxay u gaar tahay falalka farcame ee\naan kor ku soo xu snay oo kala ah saddexdan k ooxood: a) (-o obay, -owday; -\noobi), b) (-rma y, -rantay; - rmi) iyo c) (-ryay, -riday; - ryi). Waxaa qaabka\nkooxdan la wadaaga qaar ka mid ah falka caadiga ee Isrogr ogga 1°, waxaana\nugu wacan isa saameynta sh aqallada (vowal harm ony) oo keena isbeddel.,\nfalalkaas waxaa ka  mid ah falka:\n\ndhac  (-cay, -cday; dhici )\n Tus. Wax baa dhici  doona\n Isrogrogga II\n1) Qaabka fal amarku  wuxuu ku dhamaadaa – i, ama -ee\n2) Tagto qf. 3° ke .: -yay  (l.), –say (dh)\n3) Masdarka: –in , -eyn\nTus.:\n\na) kari f.g.2 (-iyay, -isay )\n1) kari! 2) kariyay ,  kari say 3) karin (doonaa )\nb)  jidee f.g.2  (-eeyay , -eysay )\n1)\njidee! 2) jideeyay , jideysay  3) jid eyn (doonaa )"
    },
    {
      "page": 15,
      "text": "XVI Isrogrogga III\n\nAstaamaha u gaarka ah isroggroggan:\n1) Qaabka fal amarku  wuxuu ku dhamaadaa – o, -so, -ow\n2) Tagto qf. 3° ke.: - tay/-day (l), – atay (dh)\n3) Masdarka: –an  (-san, -on)\nTus.:  a) baro f.g.3 (-rtay, -ratay )\n1) baro!   2) bartay, baratay   3) baran (doonaa )\nb) baxso  f.g.3 (-saday, -satay )\n1) baxso! 2) baxsa day, baxs atay 3) baxsan\nc) adkow  f.mg3  (-kaaday, -kaatay )\n1) adkow! 2) adkaa day, adka atay 3) adka an (doonaa )\nd) caroo f.mg3 (-ooday , -ootay )\n1)\ncaroo ! 2) caroo day, caro otay 3) caroon (doonaa )\n\nIsrogrogga IV\n\n1) Falalka ka tirsan kooxd an lama adeegsado fal amarkooda maadaama ay\nyihiin fal ahaansho ama fal sifo, laak iin qaab ahaan waxaan ka dhignay\nsida kuwa kale ee badan. Laba koox ayayna u kala baxaan: koox aan\nlahayn dibkabe, sida dheer, weyn, og  iwm. iyo koox  dibkabe leh,\nkuwaasoo laba cayn kala ah: a) fal+ an, sida: xiran, shid an iwm., b)\nmagac+ san, sida: jabsan, qurux san iwm.).\n2) Tagto qf. 3° ke : -aa (l), -ayd (dh)\n3) Masdarka: – aan\nTus.:\n a) dheer  f.mg4 (-raa, -rayd )\n1) dheer 2) dheer aa, dheer ayd 3) dheer aan (doona )\nb) furan ² f.mg4 (-rnaa, -rnayd )\n1) furan  2) furnaa, furn\nayd 3) furnaan (doona )\nc) jabsan  f.mg4  (-naa, -nayd )\n1) jabsan  2) jabsanaa , jabsan ayd 3) jabsanaan  (dh)\n"
    },
    {
      "page": 16,
      "text": "XVII 3.2 Falal gaar ah\n\na) Waxaa jira falal qaab  amarkoodu ku dhamaado – i oo haddana la ba siyood\nisu rogrogi kara, is rogrogga I iyo midka II. Fa lalka noocan ah waxaa loo\nadeegsan karaa labada qaabba, wa xayna wadaagaan, micnaha ka sokow,\nqaabka fal amarka iyo isrogrogga qofka 3° ee labka ee kelida ah, inta kale\nway ku kala duwanyihiin (sida qf 3° ee dh iyo masdarka). Tus.:\n 1) badi!   2) -iyay, - iday  3)  badiyi  (doonaa )\n1) badi!   2) -iyay, - isay  3) badin  (doonaa )\n\nFalalka kuwan la midka ah , si aanay u noqon laba erey oo kala gaar ah\nwaxaa laga dhigay hal er ey, inta ay ku kala duwanyihiinna waa lagu\nkordhiyey, labada si yood ee loo adeegsan karo inta la qo ray ayaa haddana\nsumadda ama (/) la dhax dhigay:\n\nbadi f.g1/2  (-iyay , -iday/-isay , -iyi )\n\nb) Waxaa jira falal fal-amarkooda ku dhamaado – oo (sida kuwa isrog. III\nxarafkiisa d) haddana qaabka irog roggoodu uu yahay mi dka II. Falalkan\nwaa koox gaar ah maadaama midkiib a uu ka koobanyahay laba fal oo\nlaysku lammaaniyay: fal la gu lifaaqay falka – goo (fal+ goo). Tus.:\n\ndabargoo  waa fal ka yimid dabar +goo.\ndabargoo  f.g2\n (-ooyay, -oysay )\n1) dabarg oo! 2) dabarg ooyay , dabarg oysay  3) dabarg oyn\n\nc) Falalka Isrogrogga II ee fal-amarkooda ku dhammaada –ee iyo –oo waxaa\ngobollada qaarkood looga yaqaannaa –ey iyo –oy (-ee = -ey/-ay iyo - oo = -\noy) hase yeeshee inta kale waa isag a mid, hab  isrogroggoodu ma kala\nduwana. Tus.\n\njidee = jidey  (-iyay, -isay ), jidayn  (doona ),  jidayn (ta)\ngoo = goy (-ooyay, -oysay ), goyn (doona ), goyn(ta)\n\nMaadaama ay aad u badanyihiin falalka loo adeegsado labadan qaab oo isku midka ah waxaa la doorbiday in hal qaab uun qamuuska lagu qoro.\nTaas micnaheedu ma aha in midka kale la yaraysanayo.\n"
    },
    {
      "page": 17,
      "text": "XVIII  3.3 Magacyada\n\nEreyada qaamuuska ee tilmaama magac waxaa hortooda ku suntan,\nerey naxweedkooda ka sokow, cayntood a naxweed (lab ama dheddig) iyo\nwadartoodaba.\na) Magaca qaab wadareedkiisu uma qorn a si kaamil ah, waxaa keliya oo  laga\nsoo qaaday xarafka ugu dambeeyo ee magaca oo aan is beddelin isagoo ku\ndheggan lifaaqa wadarta oo ra acsan cayntiisa naxweed:\n Caado m.dh  (-ooyin, m.l.) 1. Fal bulsho joogte ysato kuna dhaqanto. 2.\n Fal qof si joogta ah ugu dhaqm o. 3. Dhiig ka yimaada haweenka\n bishiiba hal mar; dhibaad;xiso;xayl\nMaydhax¹  m.dh ( -xo, m.dh) ld mayrax\n b) Magaca aan qoraal ahaan isbeddelin ma rkuu yahay kelida ama wadarta,\nlaakiin cayntiisa isbeddes ha isaga oo dhan iyo suma dda cayntiisa ayaa dib\nloo qoraa. Tus.:\ntuug m.l (tuug m.dh)\n\nc) Waxaa jira magacyo gobollada qaar kood ay cayntiisa ka dhigaan lab,\nkuwana dheddig. Sidaas ay ta hay ereyga micnihiisa iyo qaabkiisa kale waa\nisku mid, sida:   arrin ka / arrinta , guddi ga / guddi da, ballan ka / ballan ta, iwm.\n Markaas oo kale hal erey  uun baa la adeegsaday isagoo lagu hor qorayo\nastaanta labadiisa ca yn naxweed oo loo dhexays iinayo sumadda (/): m.l/dh\n(magac lab/dheddig).\nguddi  m.l/dh.. ( -iyo, m.dh) 1. Dad loo xilsaaray inay ka arrimiyaan\n xaajo doodi ka taagant ahay. 2. Dad loo xilsaa ray inay so codsiiyaan\n maamul dawladeed,  shirkadeed iwm\n\nd) Magac faleedyada (noun ve rbs) ha ahaadeen kuwa ka yimid fal-saleedka\nama kuwa ka yimid fal-farcameedka  laguma ag qorin sharraxaadda\nmicnahooda maadaama ay la micna yihiin falalka ay ka soo jeedaan.\nLabadan qaab magaceed mid ayaa hortiisa ku qoran “eeg falka” (uu\nmagacaas ka soo je edo), midka kalena waxaa ku ag qoran oo keliya “ld”\n(la mid ah magac faleedka kale)."
    },
    {
      "page": 18,
      "text": "XIX Magac-faleedyada qaaba bkan ayay leeyihiin:\n- Magacyada ku dhammaada –id   oo waafaqsan fa lalka isrogrogga I\n(tus: cun > cunid )\n- Magacyada ku dhammaada –in /-ayn oo waafaqsan isrogrogga. II\n(tus: kari > karin , same  > samayn )\n- Magacyada ku dhammaada –asho  iyo – ood oo waafaqsan isrog. III\n(tus: gado  > gadasho , caroo > carood )\n- Magacyada ku dhammaada - aan oo waafaqsan isrog. IV\n(tus: furan  > furnaan )\nTus:\n\n caadbixid , m.f.dh  , eeg caadbax² , ld caadbax¹\n\n kaddibna waxaa jira la badii erey ee kale\n  caadbax ¹ m.l ld caadbixid\n caadbax ² mg1, (- xay, -xday ; -bixi) 1. Soo c.: bannaan u soo bixid;\n muuqasho. 2.Soo c.: qof d aacad ah ahaansho.\n e) Waxaa jira ereyo aad u fa ra badan oo laga samayn  karo fal-saleedyada\niyagoo si fudud loogu qodbo lifaaqyo yeele:\n\n-e/-ye : bare (bar+e), taliye (tali+ye)\n-so/-to: taliso (tali+so), adeegto (adeeg+to)\n\nEreyada noocaas ah si ulakac ah ayaa  qaamuuska looga saaray markii laga\nreebo qaar yar oo adeegsigo odu aad u badanyahay, sida: bare, taliye,\nmeerto  iwm.\n\nf) Waxaa haray in aan xusno magacyo sifadooda gaar ah oo  dowrkooda\nkeliya uu yahay in weerta  gudaheeda ay ka qabtaan dawrka khabarka (kh)\n(predícate). Tus: ereyga caan  oo loo adeegsa do sida tan:\n\n- nin caan  ah baa yimid\n- ninku waa caan\n- *caanka baa yimid (lama yiraahdo)\n\nQaamuuskana habka soo socoda  ayaa loogu qoray ereyga caan iyo mixii la\nmid ahba\n"
    },
    {
      "page": 19,
      "text": "XX  caan  m.l.kh C. ah: wa x dad badani yaqaan.\n\nXarafka C. waa ereyga caan oo la soo gaabiyeey (C. ah = Caan ah).\nMagacyada la halmaala ereyga caan (sida: hebed, ilbax, hodan, kaamil\niwm) intooda badan lama raacsin karo qodob as agoo madaxbannaan sida\nku cad weerta: * caanka baa yimid , aan ka ahayn markii lagu\nlammaaninayo magac qodobaysan sida: ninka caan ka ah .\n\n\n\n Mahadcelin\n\nHawshaan dhammaystirkeeda waxaa kaloo noo suurtageliyay sida lixaadka iyo\nhagar la’aanta ah ee ay gacanta noogu siiyeen xagga isku duwidda iyo\nfarsamada: Francesca Bitocchi iyo Renato  Moretti oo isagu si gaar ah noogu\ntaageerey xagga hawsha kombiyuuterka. Sidaa darted waxay naga mudanyihiin in aan si gaar ah ugu ma hadcelino iyaga iyo dhamm aan intii kale ee horey\ngacanta uga gaysatay diyaarinta qaamuuskan.\n\n\nAnnarita Puglielli\nCabdalla C. Mansuur"
    },
    {
      "page": 20,
      "text": "XXI Ereyada la isku gaabiyay\n\na Amar imperativo imperative\nac aan cayinnayn indefinito indefinite\nbaay. Baayoloji biologia biology\nbot. Botani botanica botany\nbul. Bulsho società society\nc.af cilmig-afeed lingui stica linguistics\nc.beer cilmi beereed agricoltura agriculture\nc.cimi cilmiga cimilada meteorologia meteorology\nc.fal cilmi-falag astron omia astronomy\nc.naf cilimi-nafsi psicol ogia psychology\nc.nafl cilmiga-naflayd zoologia zoology\nca Cayiman definito definite\ndaaw. Daawo medicina medicine\ndd Diirad focus focus\ndh Dheddig femminile feminine\ndhaq Dhaqaale economia economics\ndhm Dhimman cliti co clitic\ndii. Diinta religione religion\ndiid Diidmo negazione negation\ndk Dibkabe suffisso suffix\ne Erey parola word\neb Ebyoon indipendente indipendent\ne.d erey dareen esclamazione exclamation\netno. Etnoloji etnologia ethnology\nf Fal verbo verb\nfals. Falsafad filosofia philosophy\nfiis. Fiisikis fisica physics\nfk Falkaab avverbio adverb\ng Gudbe transitivo transitive\nh Horyaale preposizione preposition\nisrog Isrogrog coniugazione conjugation\nj Jagaale ordinale ordinal\njool. Jooloji geologia geology\njuqr. Juqraafi geografia geography\nke Keli singolare singular\nkh Khabar predicato predicate\nkiim. Kiimika chimica chemistry\nl Lab maschile masculine"
    },
    {
      "page": 21,
      "text": "XXII ld la-mid variante variant\nlg  labagudbe ditransiti vo bitransitive\nlh laahansho possess ivo possessive\nly layeele oggetto object\nm magac nome noun\nmaan. maanso poesia/poetico poetry/poetic\nmg magudbe intransitivo  intransitive\nmi mideeya inclusivo inclusive\nmu magacuyaal pronome pronoun\nmuus. muusiko musica music\nnax naxwe grammatica grammar\nq qodob articolo article\nqaan qaanuun giuridico legal\nqf qof persona person\nqr qurub particella particle\nriw riwaayad teatro theater\ns sifo attributivo attributive\nsh.r shanqar-raac ideofono ideophone\nsiyaa. siyaasad politica politics\nso soocan esclusivo exclusive\nt tiraale numerale numeral\ntaar. taariikh storia history\ntegno. tegnology tecnologia technology\nto. tegnoloji tecnologia technology\nti tilmaame dimostrati vo demonstrative\ntus tusaale esempio example\nu urur collettivo collective\nu-j u jeediye allocutivo allocutive\nw wadar  plurale plural\nwe weyddimeed interrogativo interrogative\nwr weer frase sentence\nxi xiriiriye congiunzione conjunction\nxis xisaab matematica mathematics\ny yeele soggetto subject\n\nEreyada la isku gaabiyay waxay noqon karaan kuwo laba iyo in kabadan la\nisku lifaaqay sida: m.dh , f.mg1, f.g2, m.f. dh, m.l.u.kh, . iwm.\n"
    },
    {
      "page": 22,
      "text": "895 Naxwaha af-soomaaliga oo kooban\n\nQaybaha ugu muhimsan ee naxwaha af-soomaaliga, oo looga\nbaahanyahay xagga sifaynta af-soomaalig a, oo caadiyan loo yiqiin “qaybaha\nhadalka”, waxay yihiin: magacyada , cayimayaasha  (determiners),\nmagacuyaallada, falalka  iyo qurubyada . Inta aan loo gudagge lin sifaynta qayb\nwalba waxaa muhim ah in hoosta laga  xarriiqo waxyaaba ha qaarkood ee u\ngaarka ah ereyada af-soomaaliga.\nEreyada af-soomaaliga waxaa ka mid ah ereyo badan oo lagu magacaabi karo\nerey-saleedyo, yacnii waa ereyo aan weli naxwe ahaan caddayn waxa ay\nyihiin. Erey-saleedyada waxaa laga heli karaa weerta dhaxdeeda iyagoo ah magac,\nkaasoo noqon kara yeele ama layeele (toosan/dadban), ama isagoo ah fal u shaqaynayo khabar ahaa n (predicate). Tus.:\n- qosol  (erey-saleed)\nHalkan qosol  loogama baahna  (waa magac)\nWiilku waa qoslay  (waa fal)\n- caddayn (erey-saleed)\nCaddayn  baa lagaa rabaa  (magac)\nWaxaan caddaynayaa inaad shaqaysay  (fal)\n- quusad  (erey-saleed)\nIska ilaali quusadka (magac)\nInta aadan quusanin  ayaan kula hadlayaa  (fal)\nHaddaba waxaa la doorbiday in qaamuus ka laba jeer lagu qoro ereyada la\nmidka ah ereyga qosol  isagoo magac ah i yo isagoo fal ah.\nWaxaan halkan ku soo bandhigaynaa astaamaha guud ee ay  leeyihin koox-\nnaxweedyada ama qaybaha hadalka ee la xiriira ereyada af-soomaaliga.\n\n1. Magacyada\n\nMagacyadu waxay tilmaamaan dad, duunyo, shay, ra’yi, fal iwm sida:\nnin, ari, buug, figrad, maanta, bixid  iwm. Haseyeeshe wa xaa loo sii kooxeeyaa\niyaga oo laga eegayo qaar ka mid ah astaamahooda la xiriira micnahooda,\nmadaama astaamahaasi ay muujinayaan qaabab sarfeed iyo weereed oo kala\nduwan. Magacyadu waxay la socon karaan cayimayaal (determiners),\nkuwaasoo dib loogu lifaaqo magacyada, sida aan ku arki doonno bogagga soo\nsocda.\n"
    },
    {
      "page": 23,
      "text": "896 1.1 Qaybaha magacyada\n\nGuud ahaan magacyadu wa xay u kala baxaan:\n\na. Magacyo gaar ah , kuwaasoo lagu aqoonsado qof  ama shey gaar ah, sida:\nCali, Maryam, Moqdisho  iwm.\nb. Magacyo guud , kuwaasoo ah macgacyo aan ci dna u gaar ahayn, sida:\ngeed, nin magaalo, duqnimo  iwm, waxaana lagu lifaaqi karaa cayimayaal,\nwaxaana laga dhigi karaa wadar.\nMagacyada guud laba qaybood ayaa loo sii kala saaraa:\n  magacyo cillanaad  oo ay tilmaamayaan wax shanteenna dareemayaal\naanu dareemi karin sida: ra’yi, ceeb, run, jacayl, dadnimo  iwm.\n  magacyo caadyaal  ah oo tilmaamayaan wax nool ama shay la arki\nkaro oo la taaban karo sida: nin, guri, ari, geed iwm.\nMagacyada caadyaalka  ahi waxay u sii kala baxaan laba qaybood:\n- Magacyo tirsama  oo ah magacyo tilmaamaya dad ama shay la tirin\nkaro, sidaa darteed magacyadaas qaab wadareed ayay lahaan karaan. Tus.:\nbuug, guri, nin  iwm.\nafar buug ayaan akhriyey .\nbuugag  baan kuu soo iibiyey .\n\n- Magacyo aan tirsamin  waa magacyo tilmaamaya wax aan la tirin\nkarin sida: sonkor, biyo, caano, ciid  iwm, sidaa darteed suurtaggal ma\nah in aan niraahno:* hal sonkor , * laba  caano, *afar  ciid iwm. Tus.:\n*labo biyo ayaan rabaa  (waa qalad)\n biyo badan  ayaan rabaa  (waa sax).\n Arrirtan ayaa ugu wacan in erey adani aanay lahaan karin qaab\nwadareed. Waxaa kaloo ka mid ah  magacyada aan tirsamin magacyo\nkale oo aan tilmaamaynin qof ama neef xayawaan ah oo keliya,\nlaakiinsee tilmaamaya koox dad am a duunyo ah, oo loo arkayo sidii\nwax midaysan ama urur ah, sidaa darteed lama raacsin karo tiro wadareed, magacyadaasna waxaa lagu magacaabaa magacyo urur ,\nwaxaana ka mid ah: dad, dumar, ari, ido, caruur, geel  iwm.Tus.:\n*afar dad ayaan arkay  (qalad)\n  dad badan  ayaan arkay  (sax)\n\nSida muuqata magacyadan lama raacsiin karo tiro wadareed, waxaase la raac-\nsiin karaa oo keliya ereyga “ badan ”, sidaa darteed waxay qayb ka yihiin\nmagacyada aan tirsamin, haseyeeshee qaab ahaan magacyadan waa la"
    },
    {
      "page": 24,
      "text": "897 wadarayn karaa iyagoo lagu lifaaqayo dibkabe wadareed oo iyaga u gaar ah\n(–yaw), sida: dadyaw , geel yaw oo loola jeedo dad badan , geel badan .\n\n1.2 Astaamaha guud ee magacyada\n\na. Caynta: lab iyo dheddig\nCaynta magaca, gaar ahaan marka aan qodob raacsa nayn, waxaa lagu\ngartaa codkaca iyo dhammaad ya ra kala duwan ee ay leeyihiin\nmagacyada qaarkood, di b baanse uga faalloon  doonnaa arrintaas.\n  Magacyada labeed\nWaxaa ka mid ah: nin(ka), ari(ga), miis(ka), gabay(ga), fal(ka)  iwm.\nMagacyada labeed wa xaa lagu aqoonsadaa codkaca (tone) oo ku dhaca\nshaqalka ka horreeyo midka ugu dambeeya, magacyada dheddigna\nshaqalka ugu dambeeya ayaa codk acu ku dhacaa. Si daa darteed aad\nayay u badanyihiin magacyada ma taanaha ah, oo kala duwanaanta\ncodkacooda uun lagu kala sari karo micnaha kala duwan ee ay kala\nleeyihiin labada magac oo lab iyo dh eddig kala ah sida  kuwa soo socda:\n\nL Dh\nínan (ka) inán (ta)\nceesáan (ka) ceesaán (ta)\ndálab (ka) daláb (ta)\nshílin (ka) shilín (ta)\n\nSi loo kala saaro caynta magacyad a mataanaha ee hal alanlaha ah,\nyacnii hal shaqal oo keli ya leh, waxaa jira hab codayn kale oo lagu kala\nsaaro, waa nooc kale oo shaqalka loogu dhawaaqo: mid culus  iyo mid\nfudud . Bal isku daya in dhawaaq ahaan  aad ku kala saartaan caynta\nereyadan mataanaha ah:\n\nL (shaqal culus) Dh (shaqal fudud)\nur (ka) ur (ta)\ngar (ka) gar (ta)\ndul (ka) dul (sha)\ntuur (ka) tuur (ta)\nfool (ka) fool (sha)"
    },
    {
      "page": 25,
      "text": "898   Magacyada dheddigeed\n Waxaa ka mid ah: naag(ta), bad(da), beer(ta), cunid(da) . Waxaa kaloo\ndheddig ah magacyada ku dhamaada - o ama - i intooda badan, sida:\ndhalo(da), aragti(da),  bari(da), xero(da), jago(da), mindi(da)  iwm.\n\nb. Tirada: keli iyo wadar\nMagacyada kelida ah malaha qaab ama lifaaqyo g aar ah, waxayna\ntilmaamaan dad, duunyo, shay iyo fal, sida: guri, gacan, dal, dhagax,\nnin, rati, qarin  iwm.\nSi magacyada looga dhig o wadar waxaa jira xeer ar kala duwan oo ay\nkala leeyihiin magacyada labka iyo kuwa dheddigga.\n  Magacyada labka ee kelida ah\n   Waxay ku wadaroobaan dibkabayaal kala duwan:\n-  Magacyada hal alanlaha ah wa xay ku wadaroobaan dibkabaha -\nshibbanaha  ugu dambeeya ee magaca.Tus.:\ndal(ka) > dal al(ka),\naf(ka) > af af(ka),\nmiis(ka) > miis as(ka)\n\n- Magacyada ka kooban in  ka badan hal alan intooda badani waxay ku\nwadaroobbaan dibkabaha - o, cayntooduna dheddig ay ay isu rogtaa. Intaa\nwaxaa sii dheer in dibk abuhu siyaabo kala duwan uu ugu lifaaqmo\nereyga: Haddii magac lab oo kelida ah uu ku dhammaado: b, d, n, l, r,  waxaa\nlabalaabma shibbanaha ugu dambeeya,  cayntiisuna dh eddig ayay isu\nbeddeshaa. Tus.:\nsacab(ka) > sacab bo(da),\nwadaa d(ka) > wadaad do(da)\n\n Haddii magacu uu ku dhammaado: s, q, c, f, x, i waxaa -o  wadareedda\niyo xarfaha ku dhammaado ereyg\na la dhex dhigaa   xarafkan - y-. Tus.:\ndugsi(ga) > dugsi yo(da),\nmagac (a) > magac yo(da)\n\nQaar ka mid ah magacy ada laba alanllaha ah  oo ku wadarooba -o\nwaxay lumiyaan shaqal ka 2aad, sidoodii hore ayayna laba alanle1  u\nahaanayaan, cayntuna isma beddesho. Tus.:\n\n1 Arrintani waa xeer guud oo loo adeegsado markasta oo la arko erey dhismihiisu uu ka\nkoobanyahay shi+sha+shi+sha+shi+sha  (shi = shibbane, sha = shaqal); shaqalka gaaban ee u"
    },
    {
      "page": 26,
      "text": "899\njilib(ka) > ji lbo(ha),\ngarab (ka) > ga rbo(ha),\nilig(ga) > il ko(ha)\n\n- Magacyada ku dhammaada - e waxay ku wadaroob aan dibkabaha\n-yaal, cayntuna dheddig ay ay noqotaa. Tus.:\nbare(ha) > bara yaal(sha),\naabb e(ha) > aabba yaal(sha)\n\n- Waxaa jira magacyo la beed oo ay ku wadaroob aan marka codkaca loo\ndurkiyo xagga shaqalka 2aad, cayntuna dheddi g ayay noqotaa. Tus.:\ndibi(ga) > dib i(da)\ncarab(ka) > car ab(ta)\n\n- Qaar ka mid ah magacyada ka soo jeeda af ca rbeedka waxay ku\nwadaroobaan qaab wadareedka af carbeedka. Tus.:\ndarsi(ga) > du ruus(ta)\nmacallin(ka) > macallim iin(ta)\n\n  Magacyada dheddig ee kelida ah\nMagacyada dheddig waxay ku wadaroobaan hababka soo socda:\n- Xitaa magacyada dheddigga ahi dibkabaha - o ayay ku wadaroobaan,\ncayntuna lab ayay noqotaa. Tus.:\nkab(ta) > kab o(ha)\nbad(da) > bad o(ha)\nhaba r(ta) > habr o (ha)\ngacan(ta) > gacm o(ha)2\n\n- Magacyada dheddig ee keli da ah oo ku dhammaada - i waxay ku\nwadaroobaan dibkabaha -yo , cayntooduna lab ayay  isu rogtaa. Tus.:\nmind i (da) mindi yo (ha),\nshini (da) shini yo (ha)\n\n\ndhaxeeya waa la xadfaa, sidaasaana ereyga ku noqda saddex alalanle, wuxuu dib ugu\nnoqonayaa laba alanlennimadii hore.\n2 Labada erey ee ugu dambeeya waxaaloo adeegsaday xeerka ku xusan tixraaca hoose ee hore."
    },
    {
      "page": 27,
      "text": "900 - Magacyada dheddig ee k ilida ah oo ku dhammaada - o waxay ku\nwadaroobaan dibkabaha - oyin, waxayna isu bedd elaan magacyo lab.\nTus.:\nwaddo (da) > wadd ooyin (ka),\ndaaw o(da) > daaw ooyin (ka)\n\n\n\n2. Cayimayaasha (determiners)\n\n Cayimayaashu waa koox u qaybsan afar qaybood markii laga eego\nxagga waxqabadkooda micn eed, yacnii kala qaybint oodu waxay la xiriirtaa\nnooca xogwarran ee ay ku bi irinayaan hadba magaca  dibkabe ahaan loogu\nlifaaqayo. Waxayna u kala baxaan: qodobo, tilmaameyaal, weyddiimo  iyo\nlahaansho . Giddigoodu waxay leey ihiin: qaab labeed  oo ku bilaabanaya\nxarafka - k iyo qaab dheddigeed oo ka bilaabanaya - t, waxayna waafaqaan\nhadba caynta magaca ay ku lifaaq mayaan. Cayimayaashu marna ma\nwadaroobaan xataa haddii magaca ay ku lifaaqanyihiin uu yahay wadar.\n\n2.1 Qodobbada\n\nQodobka oo dowrkiisu yaha y in uu cayimo magaca laga hadlayo ayaa afaf\nbadani u adeegsadaan laba qaab: qodob wax ca yima iyo qodob aan wax\ncayimin. Af-soomaaliguse wuxuu leeyahay midka wax cayima oo keliya, sida\naf carbeedka. Taasi waxay la micna tahay in magaca aa nu raacsanayn qodob\nuu yahay wax aan cayinnayn ama aan la aqoonin. Tus.:\n\nNin baa yimid  (halkan qofka laga hadlayo lama yaqaan)\nNinka  ayaa yimid  (halkanse waa la yaqaannaa)\n\nQodobka soomaaliyeed qaabab kala duwan ayuu leey ahay: - ka iyo - kii oo ay\nraacaan magaca labeed iyo - ta iyo - tii oo ay raacaan magaca dheddigeed.\nHaddii lagahadluhu uu ka fogyahay qofka hadlaya ama uu yahay wax mar hore laga hadlay wa xaa loo adeegsadaa - kii/-tii, laakiin -ka iyo - ta kuma xirna\nlabadaa arrimood ee hore. Qaabka qodobku wuu isbe ddelaa, waxuuna ku xira nyahay hadba sida uu\nyahay dhammaaka magaca lagu lifaaqayo\n3\n\n3 Xeerarka aan halkan ku soo bandhigaynaa waxaa la wadaaga cayimayaasha kale ee ka\nbilaabma - k iyo - t."
    },
    {
      "page": 28,
      "text": "901   Qodobka - ka wuxuu isu beddelaa: - ha, -ga, -a. Xaaladaha keena\nisbeddelladaasin a waa kuwan:\nqodobka - ka wuxuu isu beddelaa - ha markuu raaco magac ku\ndhammaada shaqalka - e ama –o . Tus.:\nkabo + ka = kab aha,\nqore + ka = qor aha\n\n\n-  -k waxay noqotaa -g  marka ay raacdo ma gac labeed oo ku\ndhammaada: -g , -w, -aa, -u, -y ama –i. Tus.:\nbuug  + ka = buugga ,  erey + ka = ere yga,\nguri + ka = gur iga,  dhurwaa + ka = dhurw aaga\nhu + ka = h uga,  qabo w + ka  = qabo wga\n\n- -k waxay noqotaa - a marka ay raacdo magac labeed oo ku\ndham\nmaado: - h, -x, -q, -c, -kh. Tus.:\nmadax  + ka = mada xa, ra h + ka =raha ,\nmagac  + ka = maga ca, dii q + ka = dii qa,\ntookh + ka = too kha.\n\n  Qodob dheddigeedka -ta  isna wuxuu isu beddelaa: - da ama - sha.\n- -t  waxay noqotaa - d marka ay raacdo magac ku dhammaada shaqalka\n-o ama - d, -c, -x, -h, -y, hamsa  (‘). Tus.:\nmaro + ta = mara da , bad  + ta = bad da,\nqoda x + ta = qodax da, ba c + ta = bacda ,\ngalla y + ta = gallay da  bu’  + ta = bu’ da\n\n- -t  waxay noqotaa - sh ma\nrka ay raacdo magac ku dhammaada – l. Tus.:\nul + ta = usha  i l + ta = isha\nbil +ta = bisha dha l + ta = dha sha\n\n\n2.2 Dibkabayaasha tilmaamayaasha\n\nTilmaamayaasha, sida qodobbada, ayaa ma gaca gadaal looga lifaaqaa,\ntiradooduna waa saddex, ka la duwanaantoodu waxay la  xiriirtaa masaafada u\ndhexaysa hadlaha iyo waxa  uu tilmaamayo. Masafada as saddex meelood ayaa\nloo kala saaraa:\n"
    },
    {
      "page": 29,
      "text": "902 cayn\ndhawaan  durugsan  baallayn\nLab - kan -kas -keer\nDheddig - tan -tas -teer\n\nTilmaamyaashu waxay raacaan xeerar ka isbeddel-codeeka ee aan ku soo\nxusnay qaybta qodobbada, sida laga dareemaayo tusaalayaashan. Tus.:\nNinkan  ayaa iska leh baabuurka\nGabdha haas ayaa u socda dugsiga\nWiilkeer baa arday ah\n\n2.3 Dibkabayaasha lahaanshaha\n\nXitaa dibkabayaasha lahaanshaha waxay u kala baxaan lab iyo\ndheddig, waxayna muujiyaan wa xa uu milkiiluhu leeyahay:\n\nqofka lab dheddig\n1° -kayga -tayda\n2° -kaada -taada\n3° l -kiisa -tiisa\n3° dh -keeda -teeda\n1° w.so -kaayaga -taayada\n1° w.mi -keenna -teenna\n2° w -kiinna -tiinna\n3° w -kooda -tooda\n\nQaababkan lahaan sho waxay ka koobanyihiin la ba shay: dibk abe lahaansho\niyo qodob, sida dibkabaha kayga  oo ka soo jeeda kay + ka .\nXitaa dibkabayaasha lahaansh ahu waxay ku billaabmaan - k kuwooda labka\nahi, kuwa dhedd igga ahina - t, sidaa darteed waxy  raacaan xeerarkii\nisqabadyada ee aan kor ku soo xusnay. Tus.:\nbuug gayga  < buug + kayga\narday diisa < arday + tiisa\ndalkeenna  <dal + keenna\nushiinna  <ul +  tiinna\nIshiisa  lagu arke\nUshiisa  lagu dilaa"
    },
    {
      "page": 30,
      "text": "903\n2.4 Dibkabayaasha weyddiinta\n\n Waxaa loo adeegsadaa marka la weyddiinayo in la  ogaado magaca\nqofka yeelaha ama layeelah a ah. Dibkabaha –kee labka ayuu u gaar yahay, -tee\nna dheddigga. Tus.:\ndalkee < dal + kee\nmeeshee < meel + tee\nsaacad dee < saacad + tee\nBuug gee baad akhrisay?\nNinkee  baa yimid?\n\n3. Magacuyaallada\n\nMagacuyaalladu dhowr siyood ayay  u kala baxaan.Waxaan ka\nhadalkooda ku billaabaynaa magacuyaallada qofeed  oo ay u kala baxaan:\nmagacuyaallo qofeed ee ebyoon  iyo magacuyaallo qofeed ee dhimman .\n\n3.1 Magacuyaallo qofeed ee ebyoon\n\n Waxay matalayaan magacyada, w eerta gudaheeda wa xay ka qabtaan\nkaalinta yeelaha iyo laye elaha, waxayna yeelan ka raan weer faahfaahineed\n(relative phrase) iwm. Tus.: Iyadu  dugsiga ayay aadday (yeele)\nCali iyada  buu la hadlay (layeele)\nIyada oo caraysan  baa timid\nAnigu iyada oo taagan  baan arkay\n\nInta badan waxaa ku lifaaqan qodobka - ka/-ta , sida aniga (ani + ka), mararka\nqaarkoodna qodob la’a an ayay ahaan karaan, gaar  ahaan marka lagu lifaaqayo\nxiriiriyaha - na ama diiradeeyaha baa/ayaa . Tus.:\nadiga < adi + ka\nadna  < adi + na\nadigàa < adi + ka  + baa\nadàa  < adi + baa\n\nMagacuyaallada qofeed ee abyoon waxay ka ko obanyihiin 8 qaab:\n\n1° ke. ani-ga\n2° ke. adi-ga"
    },
    {
      "page": 31,
      "text": "904 3° ke.l isa-ga\n3° ke.dh iya-da\n1° w.so anna-ga\n1° w.mi inna-ga4\n2° w idin-ka\n3° w iya-ga\n\n3.2 Magacuyaallada qofeed ee dhimman\n\n Waa qayb gaar ah, maxaayeelay ma geli karaan kaalinta magaca, sida\naan ku aragnay magacuyaal lada abyoon. Waxaana shardi  ah in lagu meeleeyo\nfalka hortiisa oo keli a h, halkaasoo ah rugtaa koox faleedka (horyaallada,\nmagacuyaallada dhimman iyo qurubyo kale), kuwaa soo isku dhafma. Tus.:\nWiilkaas baa i arkay\nWiilkaas baa igu arkay xafiiska (igu < i +ku)\nArrintan mar hore ayaan kaaga  digay ( ka+u+ka)\nWar cusub buu noola  yimid (na +u+la)\n\nMagcuyaallada dhimman laba qaybood ay ay u kala baxaan, waxayna ku kala\nduwanyihiin xagga kaalinta  ay ka kala qabtaan weerta gudaheeda. Qayb\nkaalintoodu marwaliba waa yeele,  qaybta kalena waa layeele.\n\na. Magacuyaallada dhimman ee  yeelaha ah waa kuwan:\n\n1° ke. aan\n2° ke. aad\n3° ke.l uu\n3° ke.dh ay\n1° w.so aan / aannu\n1° w.mi aynu\n2° w aad / aydin\n3° w ay\nTus.:\nMacallinka aad  aragtay waa taariikhyahan\n\n4 Si loo muujiyo qaabka kooban ee magacuyaalka waxaa gaar looga bixiyey qodobka. Midda\nkale ereyga so  (soocan) waxaa loola jeedaa in qaabka aan/aannu la adeegsado marka lala\nhadluhu uusan ka mid ahayn yeelayaasha, ereyga kale mi (mideeya) isna wuxuu tilmaamayaa\nin ereyga aynu la adeegsado marka lala hadlaha uu ka mid yahay yeelayaasha."
    },
    {
      "page": 32,
      "text": "905 Halka ay Maryan ku sugantahay b aan (baa + aan) aqaanaa\nWaxaynu  rajaynaynaa in maamulahu uu dhakhsi ku yimaado\n\nb. Magacuyaallada dhimman ee layeelaha ah iyagun a markooda laba qayb\nayay u kala baxaan:\n  Kuwan hore ayaana adee gsigoodu badanyahay:\n\n1° ke. I\n2° ke. Ku\n1° w.so Na\n1° w.mi Ina\n2° w Idin\n3°ke.l/3°w Ø (ma laha)\nTus.:\nWay idin arkeen\nWaad na hagaajisay\nMuxuu ku baray macallinku?\n\nSida muuqata qofka 3° ee kelida ama wadarta ah ma laha qaabka\nmagacuyaalka dhimman ee layeelaha ah, haddaba maqnaashihiisa waxaa loo fasirtaa in uu yahay qofka 3°, qofka falka leh waxaa laga garan karaa waxa laga hadlayo (context), sida weertan oo kale: way keeneen , yeeluhu wxuu\nnoqon karaa wadar lab ama dheddig ama waxyaabo aan nooleen.\n  Kuwa kalena waa kuwan:\n\n1° ke. kay\n2° ke. kaa\n1° w.so kayo\n1° w.mi keen\n2° w kiin\n3° ke.l/3° w Ø (ma laha)\n\nMagacuyaalladan waxaa la adeegsadaa markii barta koox faleedyada\nay ku wada kulmaan laba magacuyaal dhimman.Tus.:\nWuu iga kaa weyddiiyay\n  Aan isku kiin sheego\n"
    },
    {
      "page": 33,
      "text": "906\nc. Waxaa kaloo ka mid ah qaybaha magacuyaallada dhimman labo\nmagacuyaal kale: la iyo is.\n  La waa magacuyaal yeele oo aanu caddayn qofka loola jeedo, waa\nqof-laawe (passive), falkuna wuxuu ula dhaqmaa sidii qofka 3° ee lab\noo kelida ah.Tus.:\nWaa la xaday\nWaa lagu arkay (lagu < la + ku mu.2°ly.ke)\n\n  Is waa magacuyaal aan is beddelin oo layeele ah, muujinayana in falku\nuu ku noqonayo isla yeelaha ama wax la is weydaarsanayo.Tus.:\nWuu is dilay  (fal noqod)\nWay is arkeen  (isdhaafsi).\n\n3.3 Koox kale oo ka mid ah  magacuyaallada ebyoon\n\nQaababka cayimayaasha (yacnii dibkabayaasha tilmaamaha, lahaan-\nshaha iyo weyddiimaha ee ko r ku xusan) oo lagu lifaaqo magacyada, waxaa\nloo adeegsan karaa si madaxbannaan, ya cnii  magacuyaal ebyoon ayay yihiin.\nMagacuyaalladan waxay kaloo cayimayaas ha uga duwanyihiin in ay leeyihiin\nqaab wadareed oo aan u kala soocnayn lab iyo dheddig iyo arrima kale oo aan\nmid mid u arki doonna:\n\na. Magacuyaallo tilmaame\n  Magacuyaalladan laba arrimood ayay uga duwan yihiin dibkabayaasha\ntilmaame. Waxay leeyihiin qaab wa dareed iyo qaab 4° oo aan lahayn\ndibkabayaasha tilmaame oo tilmaam aya wax meel shishe yaalla.\n\ncayn dhawaan durugsan baallayn shishayn\nlab kan/ka kaas/kan keer koo\ndheddig tan/ta taas/tan teer too\nwadar = l. & dh. kuwan kuwaas kuweer kuwoo\n\nTus.:\nKuwaas  baa ka yimid dibadda\nKeer  yimid maanta waa walaalkay\nWaa tan mucallimadda cusub\nKani  waa walaalkay"
    },
    {
      "page": 34,
      "text": "907\nb. Magacuyaallo lahaansho\n\nXitaa magacuyaallada lahaansho waxay u kala ba xaan lab iyo\ndheddig, waxayna leeyih iin qaab wadareed ca yntiisu aanay u kala\nsoocnayn lab iyo dheddig.\n\nqof lab dheddig wadar\n1° kayga tayda kuwayga\n2° kaada taada kuwaaga\n3° l kiisa tiisa kuwiisa\n3° dh keeda teeda kuweeda\n1° w.so kaayaga taayada kuwayaga\n1° w.mi keenna teenna kuweenna\n2° w kiinna tiinna kuwiinna\n3° w kooda tooda kuwooda\n\n  Tus.:\nHaddaadan baabuu r wadanin kayga  qaado\nArdadiinna kuwayaga ayaa ka firfircoon\nWallee ina ragow  tala adduun taada  uun ma aha\n\nc. Magacuyaallo aan cayinayn\n\nMagacuyaalladan waxay tilmaamaan qof ama wax aan\ncayinayn oo magaciisa aan la aqoo n, waxayna noqon ka raan yeele ama\nla yeele, waxayna leey ihiin qaab wadareed.\nXitaa qodobka kii/tii waxa loo adeegsan ka raa magacuyaal ahaan\nmarka la doonaayo in la qariyo qof magaciisa.\n\nlab dheddig wadar\nku tu kuwo\nkoo too kuwo\nkii tii kuwii\nmid mid kuwo\n"
    },
    {
      "page": 35,
      "text": "908 Tus.:\nTu aan la aqoon baa timid\nMid baan halkaas ku arkay\nKu aan la aqoonin ayaan  halkaas ku arkay\nKuwo  dibadda ka yimid ayaan ka maqlay\nKii baa yimid\n\nd. Magacuyaallo weyddiimeed\n\nMagacuyaallada soo socda waxaa la adeegsadaa oo keliya\nmarka la doonayo in la ogaado qof ama shey magaciisa kaasoo yeele ama\nlayeele noqon kara:\n\nlab dheddig wadar\nkee tee kuwee\nkuma tuma kuwama\nyaa yaa kuwee\n\nTus.:\nKee baa kula quman?\nWaa tuma  midda soo socota?\nYaa kuu sheegay warkan?\nKuwee  baa kula fiican?\nTumaad aragtay\n\n4. Falalka\n\n Waxaanu halkaan ku soo koobaynaa sifaynta sarfaha hodanka ah ee\nfalalka af-somaaliga, ha ahaato xagga isrogrogga iyo xagga farcamidda.\nDhismaha aasaasiga ee qaab abka falalka af-soomaaliga intooda badani waa\nsidatan:\nI II III IV\nSalka ereyga Salkordhiye Qof Isrog.(amminka)"
    },
    {
      "page": 36,
      "text": "909 I - Salka ereyga\n\n Waa unugga matilaya micnaha erey ga. Waxaana ka mid ah falalka\nsida: cun, qor, xir, dil iwm. Dhammaan sal-faleedya da fal-gudbayaasha iyo fal-\nmagudbayaasha ee aan laha yn lifaaqyo (yacni i dibkabe la’aan  ah) waxay ka\nmid yihiin kooxda isrogrogga 1°. Sida aan dib ugu ar ki doonno xitaa sa lka ereyga wuxuu no qon karaa mid ka\nkooban sal iyo dibk abe, sida falalka asalk oodu ka soo jeedo magac: duq, carro\niwm oo markii lagu lifaaqo dibkabaha -ow  ay noqonayaan falal. Tus.:\nDuqow < duq + ow\nCarr ow < carro + ow\n\nmicnihii magacyadan waxaa loo roga y micna aan kii ho re ka duwanayn,\nlaakiin leh qaab faleed.\n II - Salkordhiye\n  Waa wax markii lagu lifaaqo salka uu ereyga ku kordhiyo micna dheeraad ah, isagoo beddelay a xataa tirada kaqaybgalayaasha hawsha, sida aan\nka dareemayno weertan:\nKoobku waa jab ay\n\nWeertani waxay leedahay  hal magac oo yeele ah, falkuna waa fal-magudbe,\nweerta:\nMaryan koobka way jabisay\n\nwaxaa ku jira labo magac oo kala ah ye ele iyo layeele, falkuna markan waa\nfal-gudbe. Haddaba sal-faleedka jab oo ah fal-magudbe ka tirsan kooxda\nisrogrogga 1° waxa a lagu kabay sa lballaariyaha - is oo ka dhigay fal-gudbe oo\nka tirsan kooxda isrogrogga 2°.  III - Qof\n Waa shayga muujinaya iswaafajinta falka iyo qofka ah  falaha weerta:\n"
    },
    {
      "page": 37,
      "text": "910 (Iyadu) way cun tay [      cun       ] [      t      ] [      ay      ]\n sal waaf. qf 3°dh isrog. tagto\n(Annagu) waan cun nay [      cun      ] [      n      ] [      ay      ]\n sal waaf. qf 1°w isrog. tagto\n(Isagu) wuu cunay [      cun       ] Ø [      ay       ]\n sal waaf. qf 3°ke isrog. tagto\n\nIV - Isrogrogga\n  Isrogroggu waa sh ayga muujinaya falka ammink iisa (tense), muuqaalkiisa\n(aspect) iyo habkiisa (m ood). Iskudhafka lifaaqa is waafajiyaha qofka iyo\namminku wuxuu soo saaraa 5 qaab oo kala duwan, laakiin waxaa loo\nadeegsadaa 8 nooc magacu yaal oo kala duwan. A rrintaasna waxaa tusaale\nahaan aan ka arkaynaa falka cun isrogroggiisa amminka joogtada iyo tagtada\nah:\nqofka  tagto joogto\n1 ke (waan) cun – Ø – ay  cun – Ø – aa\n2 ke (waad) cun – t – ay cun – t – aa\n3 ke. l (wuu) cun – Ø – ay cun – Ø – aa\n3 ke. dh (way) cun – t – ay cun – t – aa\n1 w. so (waan) cun – n – ay cun – n – aa\n1 w. mi (waynu) cun – n – ay cun – n – aa\n2 w (waad) cun – t – een cun – t – aan\n2 w (way) cun – Ø – een cun – Ø – aan\n\nSida muuqata waa eber (Ø ) lifaaqa qof qofka 1°ke, 3°ke.l; 3°w; lifaaqa - t-\nwaxuu u gaar yahay qofka 2°ke, 3°ke.dh, 2°w; lifaaqa - n- isna waxaa u gaar\nyahay qofka 1°w. Lifaaqyadan waxaa lagu  sii lifaaqaa dibkabaha isrogrogga\nfalka tagtada oo ah - ay ama -een , marka falku uu yahay joogtana wa xaa lagu\nlifaaqaa - aa/-aan. Dabcan, isrogrogyada nooc yadoodu way badanyihiin oo\nkuma eka oo keliya midka la xiriira amminka aan tusaal e ahaan kor ku soo\nmuujinnay, laakiin waxaa ji ra kuwa kale oo la xi riira muuqaalka (aspect),\nhabka (mood) iyo xataa marka falku yaha y qaab diidmo ah (tusaalooyinka la\nxiriira isrogroyadan waxa a laga helayaa shaxda isrogrogga falalka).\n"
    },
    {
      "page": 38,
      "text": "911 4.1  Kooxaynta falalka\n\n Af-soomaaliga, isagoo laga eegayo xagga isrogrogga, waxaa la\nogaadey in falalku ay u ka la baxaan laba qayb sarfeed : a) qayb aad u tira badan\noo leh dibkabeyaal, b)  iyo qayb sooyaa l ah oo si gaar ah ay u leeyihiin sarfe\nhorkabe iyo dibkabe ah, qaybta an waxaa ka mid ah falka yahay  oo marka uu\nyahay tagto u dhaqma si da falalka dibkabayaash a leh, marka uu joogto\nyahayna wuxuu noqdaa fal dibkabe ah\n\na. Kooxda 1°: falalka dibkabaya asha leh (Isrogroggooda)\n\nFalalka kooxdan 1° oo sarfahoodu aa nu fududayn waxay ka koobanyihiin\n4 nooc isrogrog oo kala duwan.\n\n  Isrogrogga 1°\nIsrogroggani waxaa u gaar ah falalk a aan salkoodu lahayn lifaaqyo, ha\nahaadeen fal-gudbe ( cun, qor, xir...) ama fal-magudbe ( tag, jab, kar… ).\nTus.:\nCali baa cun ay tufaaxa\nGabadha ayaa qor tay warqaddan\nKoobku wuu jab ay\nNimanku way tag een\n\nIsrogroggan koowaad waxaa kaloo ka mid ah xitaa falal sal ballaariye\nwata, saddex qayb ayay na u kala baxaan:\n- Qaybta 1° waa fal-magudb ayaal oo ka yimaadeen:\nmagac + ow\nbaraf + ow = baraf ow (tus.Biyuhu way baraf oobeen)\nnacas + ow = nacasow\n\n-  Qaybta 2° waxay ka  koobantahay fal (-gudbe-sababeeye) + am.\nLifaaqan wuxuu weerta ka  dhigaa yeele-laawe (p assive), falkuna waa\nfal-magudbe.\nF + -am\nxir + -am  (tus.: Albaabku waa xir may)\n\n- Qaybta 3° waa fala lka ku dhammaada  - i , kuwaasoo u dhaqma\n qaabka isrogrogga 1° iyo midka II°ba, sida falka badi oo labada\n siyoodba loo ad eegsan karo:"
    },
    {
      "page": 39,
      "text": "912\n  -iyay -iday badiyid (1° isrog.)\n Tus.: Kooxdan ayaa badid ay\nbadi\n-yay -isay badin (2° isrog.)\n Tus.: Kooxdan ayaa badis ay\n\n  Isrogrogga 2°\n Isrogroggani waxaa uu ga ar u yahay falalka asalkoodu ka yimid falal\nkale oo lagu lifaaqay dibkabe.\n\n- F + - is (lifaaq sababeed)\nkar (f.mg)   Shaahu wuu karay   kar + is = kar is (f.g)  Ubax shaah bay karis ay\njab (f.mg)   Dhaladu way jabtay  jab + is = jab is (f.g)  Caasha dhalada ayay jeb isay\n\n- N + -ée/ -ayn\nsun + - ée = sum ee  Yaa cuntada sum eeyey?\nqado + ayn = qadayn    Xageed ka qadayn  rabtaa?\nrun + ayn  = rumayn   Wax la rum ayn karo ma aha\ncidlo + - ée  = cidl ee  Maxay guriga u cidl eeyeen?\n\n- Falalka isrogrogga 4° + -ée\nadag + - ée =adk ée   Aad ayay u adk eeyeen imtixaanka\nyar + ee = yar ee  Intaa ka badan lama yar eeyn karo\n\n  Isrogrogga 3°\n\nKuwa isrogroggan raacsan waxaa ka mid ah falal farcame oo leh lifaaqa\n–at oo falka ku soo kordhiya micne w\nax samaysasho.\n\n- F + -at\nqaado + at = qaad ad Lacag ayuu qaatay  (qaa dtay = qaa ttay)\nguuris + at  = guurs ad Cali gabar buu guursa day\nyarow + at = yara ad Biyuhu way yaraa deen"
    },
    {
      "page": 40,
      "text": "913\n- M + - at\ngeeri +  at =  geriy ood Xagguu ku geeriy ooday ninku?\ngaajo + at = gaaj ood Aad baan u gaaj ooday\n\n  Isrogrogga 4°\n\nKuwa isrogroggan raacsani waa falal gaar ah oo badankuudu ay\nleeyihiin micno aan ka fogayn sifada (adjecti ve), haseyeeshe markii\nlaga eego xagga sarfaha iyo weerey ntaba waxay u dhaqmaan sida falka,\nwaxayna marwalba ay ku lifaaqanyihiin falka ahaw , sidaa awgeed\nwaxaa lagu ma gacaabaa “ fal sifo ”, oo Andrzejewski-na uu ku\nmagacaabay “hybrid verbs”.  Falal sifo laba qaybood ay ay u kala baxaan: a) fa l saleedyo ama fal sifo\noo asal ah ( oo dadka qaarkood ay ku tir iyaan inay yihiin sifooyin), sida:\ncad, yar, weyn , dheer , adag, leh, jecel, macaan , og, la’, oggol , cusub ,\niwm. b) fal sifo kuwa ug u badan oo ka soojeeda falal kale ama magacyo\niyagoo lagu kabay lifaaqyada - an / -oon.\n\n- F (fal saleed): adag, yar, weyn, og\nadag  Way adagtahay  inuu yimaado maanta (adag + tahay)\nyar  Wiilku wuu ka yaraa  gabadha. (yaraa < yar + ahaa)\nweyn  Anigu waan kaa weynahay (weynahay <weyn + ahay)\nog  Waan ogaa  in aad dhooftay (ogaa < og + ahaa)\n\n- F + -an\nxir + -an  = xir an\nxafiisku wuu xiranyahay\nShalayna wuu xirn\naa\n\n- M + -oon\nudug + - oon = udgoon\nCatarkan aad buu u udgoonyahay\n\n- M + -an\nguduud + - an = guduud an\nQalinku wuu guduudanyahay"
    },
    {
      "page": 41,
      "text": "914\nb. Kooxda 2°: falalka horkabeyaasha leh\n\nKooxdan waxay ka kooba ntahay falal tiradood u aad u koobantahay,\nhaddana adeegsigoodu aad buu u bada nyahay. Waxay leeyihin lifaaqyo\nhorkabe iyo dibkabeba ah  oo isrogroga, waxayna isu rogrogaa n qaabka\nugu qaddiimsan ee luqadd a. Kooxdan waxaa ugu muhimsan shantan fal\nee hoos ku xusan:  aqoo, aal, imow, dheh, ahaw.  Tus.:\nWaxaa nimid marka ay iyagu y imaadeen.\nQofka aad taqaanaa  waan kula aqaanaa.\nAnigu shalay ayaan imid, idinkuna goormaad timaaddeen ?\nXaggay yaallaan buugaagtu.\nMa xasuusantaha y waxa aan ku niri ?\n\nFalka shanaad oo ah ahaw  wuxuu horkabe leeyahay amminka joogtada\noo keli ah.  Tus.:\nWaxaad tahay nin wanaagsan\n(Falalkan isrogroggooda oo kaamil ah ka eeg boga gga shaxda hogatuska.)\n\n5. Qurubyada (particles)\n\n Qaybtan waxaa lagu qaadaadhigay aa qurubyo aan isbeddelayn oo\nweerta gudaheeda ka kala  ciyaara kaalimo kala du wan, waxayna kala yihiin:\nhoryaalayaasha, xiriiriyeyaasha, qu rub diiradeedyada, iyo qurubyo cayima\nnooca ay weertu tahay.\n5.1 Horyaalayaasha (prepositions)\n\n Waa qurubyo bartoodu ta hay falka ka hore (halkaasoo ay ku\nlifaaqmaan magacuyaallada dhimman oo layeelah a ah), waxay weerta\ngudaheeda ku hayaan magaca aan yeelaha ahayn, yacnii horyaalkaas\nla’aantiisa magacaas  kama mid ahaan karo weer ta. Horyaalayaa shu waa afar:\nu, ku, ka, la. Sida soo socota ay ayna u shaqeeyaan:\na. Ku iyo ka\nwaxay isku xiraan falka iyo meesha  fakaasi uu ka dhacayo. Tus.:\nCali wuxuu ka shaqeeyaa warshadda\nXasan suuqa  ayaan ku arkay\n\n- Ka waxaa kaloo loo adeegsadaa meel ka imaansho. Tus.:"
    },
    {
      "page": 42,
      "text": "915 Nin baa Gaalkacyo  ka yimi.\n\nSidoo kale mawduuc laga hadlayo ayaa loo adeegsadaa. Tus.:\n Axmed taariikhdiisa ayuu ka hadlay\n\n- Ku waxaa kaloo loo adeegsadaa wasiilo. Tus.:\nBariiska qaaddada  ku cun!\n\nb. U waa horyaale 4 si yood loo adeegsado:\n\n- hadaf ama ulajeeddo ayuu  la xiriiraa. Tus.:\n Wiilku wax buu u danleeyahay?\n\n- ama jiho. Tus.:\n Aadan dibadda ayuu u dhoofay.\n\n- ama cid u samafalid. Tus.:\nMaryan, wiilka shaah u kari!\n\n- ama hab. Tus.:\nSi wanaagsan u habay!\nSi fiicaan u akhri!\n\nc. La waa layeele tilmaama la ji rid ama wadajir. Tus.:\n Cali aabihiis ayuu la joogay.\n\nHoryaalayaasha rugtoodu waa falka hort iisa, magaca ay la shaqeeyaanna meel\numa go’na. Haddii weer gudah eeda laga helo in ka badan hal horyaale waxay\nku wada kulmaan falka hortiisa5 , mararka qaarkood wa xaa dhici karta in\nmagaca uu la xiriiro lagu wareero sidii l oo fasiri lahaa, waxaa keliyah oo lagu\nkala saari karaa xaaladda (context), sida weertan:\nAxmed baa odayga wiilka  guriga ugu geeyey\n(yaa la geeyey, ya ana loo geeyey?)\n\nWeertan kale ee fudud:\n\n5 Iskudhafka horyaallada iyo magacuyaallada dhimman ee layeelaha ah waxaad ka eegtaa\nshaxda hogatuska."
    },
    {
      "page": 43,
      "text": "916 Axmed baa qaada y buugaagta.\n\nHaddii aan ku darno cidda  loo soo qaaday iyo m eesha laga soo qaaday\nbuugaagta waxaa soo baxays aa weertan ballaaran:\nAxmed baa Maryam  uga qaaday buugaagta miiska.\n Weertan waxay ka timid is ku dhafka labadan weerood:\nAxmed baa ka qaaday buugaagta miiska +\nAxmed. baa u qaaday Maryam  buugaagta\n Horyaallada isku dhafan ama ku dhafan  magacuyaallada layeelaha ah oo\nkaamil ah waxaad ka eegtaa shaxda  horyaallada iyo magacuyaallada.\n\n5.2 Xiriiriyeyaal\n\n Qurubyadan hawshooda  aasaasiga ahi waa xi riirinta ereyada ama\nweeraha. Xiriiriyeyaasha ugu muhimsan iyo waxa ay kala qabtaan waxaa ka\nmid ah:\n  iyo\nXiriiriyahani wuxuu isku xiraa magacyo, magacuyaal lo iyo tirooyin.\nTus.\n:\nCali iyo Maxamed waa walaalo\nAniga iyo adiguba waan aragnay\nLabaatan iyo shan sano ayuu jiraa\n  na\nWaxay isku xirtaa laba weerood, siiba marka ay ka la leeyihiin yeele ama\nfal kala duwan, weerta la baad ereygeeda koobaad ay ayna isku lifaaqdaa.\nTus.:\nCali bariis buu cunay Jaamac na baasto\nGuriga ayaan aadayaa waa na seexanayaa\nWaan tagayaa adigu na?\n\n  oo\nXiriiriyahan siyaabo kala duwan ayaa loo adeegsadaa, inta ugu\nmuhimsanina waa kuwan :\n- Iskuxiridda labo weer tebineed oo ebyoon ama labo weer amar. Tus.:\nAwees waa wiil dheer oo cas\nGeeddi oo dhowaan yimid ba a keenay alaabta"
    },
    {
      "page": 44,
      "text": "917 Soo orod oo ii kalay!\n\n- Iskuxiridda laba fal oo is ku mar la qabtay. Tus.:\nAnigoo soo socda baa Ca li ii yeerey\n\n\n  ee\n  Xiriiriyahanna siyabo ka la duwan ayaa loo adeegsadaa:\n- wuxuuna isku xiraa laba weerood. Tus.:\nAmed ma seexan ee Ubax baa seexatay\nDaah ha cun ee\nAan seexann ee, nalka naga dami!\n\n- Waxaa kaloo loo adeegsadaa orah  magaceed (nominal phrase)\ngudaheeda. Tus.:\nDukaanka dahabka ee Caasho ayaa dhow\n\n  -se\nWaa xiriiriye lid oo isku naba weerta  dambe ereygeeda koobaad sida aan\nku soo aragnay – na. Tus.:\nFaarax wuu tagay Geeddi se wuu seexday\n   ama/mise\nLabadan xiriiriye waxay isku xiraan labo erey am a labo weerood oo kala\nduwan. Mise  weer weyddiimeed ayaa loo adeegsadaa, amana weer aan\nweddiin ahayn.Tus.:\nCali guriga ayuu jiraa ama shaqada\nYaad doonaysaa, Cabdullaahi mise Saciid?\n\n  laakiin /haseyeeshee\nLabadan xiriiriye, inkastoo aan ah ayn qurbyo, haddana hawshoodu kama\nduwana waxa ay qabtaan xi riiriyeyaasha kale, sida xiriiriyaha ee ayay u\nmuujinayaa micno iska  soo horjeeda. Tus.:\nCalasow wuu yimid laakiin  kuma arkin\nSaynab way timid haseyeeshee  kuma arkin\n\n5.3 Qurub diiradeedyada (focus marker)\n\n Qaybtan waxay ka koobantahay: baa  iyo ayaa. labadan qurub oo isku\nsi loo adeegsado waxay diir adda saaraan magaca ay ka dambeeyaan ama ay ku"
    },
    {
      "page": 45,
      "text": "918 ag dhowyihiin, hawshoodun a waxay tahay in ay m uujiyaan in magacaasi uu\nyahay mid sida warka cu sub ee la rabo in loo gudbiyo dhageystaha ama\nakhriyaha, Tus.:\nCali baa ka yimid Afgooye\n\n(weertan waxaa laga dareemayaa in hor ey loo ogaa in laga  yimid Afgooye,\nwarka cusubse wuxuu yahay in Cali uu yahay qofka yimid oo ah yeelaha\nweerta, weertaa waxay jawaab u tahay weyddiinta ah: yaa ka yimid Afgooye?)\nQurubyadan marka ay d iiradda saarayaan layeelaha waxay ku dhafmaan\nmagacuyaallaka dhimman oo yeelaha ah.Tus.:\nGabadhu Cali bay (baa+ay) aragtay\n\nGaar ahaan marka la hadlayo qurubkan  wuxuu ku lifaaqmi  karaa magaca:\n\nCalaa (Cali + ayaa) yimid\n\nWaxaa kaloo qurub diiradeedy ada la halmaala ereyga waxaa. Ereygan\nhawshiisu kama duwana midda  ay qabtaan labada qu rub ee aan kor ku soo\nxusnay, laakiin dhaqan gaar ah a yuu leeyahay marka laga eego xagga\nweereynta, maxaayee lay magaca uu diiradeynaayo wuxuu u wareejiyaa weerta\ndhammaadkeeda.Tus.:\nAadan wuxuu  arkay faras cad\n(Aadan faras cad ayuu  arkay)\n\n5.4 Qurub weereedyo kala duwan\n\nWeeraha lagu magacaabo: weer caddayn  (declarative sentence), weer\nweyddiimeed, weer amar, weer  shardiiley iyo weer talo  (obtative sentence)\nwaxay leeyihiin qurubyo kala duwan  oo muujinayaan kala duwanaanta\nhababka (mood)  falalka.\nWaa kuwan, qurubyada  ugu muhimsan (waa , ma, ha, sow, y-) iyo\ntusaalooyinkooda:"
    },
    {
      "page": 46,
      "text": "919\na. weero caddayn\n qurubka qaab faleedka\nw. caddayn waa sugaa\nw. weyddiimeed ma sugaa\nw. amar --- sug (ke)/ suga (w)\nw. shardiiley waa sugi lahaa\nw. talo ha sugo\n\n\nb. weero diidmo\n qurub q. diidmo q. faleed\nw. caddayn --- ma sugo\nw. weyddiimeed sow ma sugo\nw. amar ha --- sugin/suginina\nw. shardiiley --- ma sugeen\nw. talo yaanu --- sugin\n\n\n\nRaadraac\n\nAndrzejewski, B.W. “Pr onominal and prepositional particles in Nothern\nSomali”, African Language Studies , 1, 1960.\nAndrzejewski, B.W. “Inflect ional characteristics of the so-called week verbs in\nSomali”, African Language Studies , 9, 1968.\nAndrzejewski, B.W “Some observation on hybrid verb s in Somali”, African\nLanguage Studies ,10, 1969.\nPuglielli, A. Sintassi della lingua somala , Studi Somali 2, Roma, MAE,1981.\nPuglielli, A. “La derivazione  nominale in Somalo”, in A. Puglielli (a cura di)\nAspetti morfologici, lessic ali e della fo calizzazione , Studi Somali 5 , Roma,\nMAE, 1984."
    },
    {
      "page": 47,
      "text": "920 Puglielli, A . e Ciise Mahamed Siyaad, “L a flessione del nome” , in A. Puglielli\n(a cura di) Aspetti morfologici, lessicali e della focalizzazione , Studi Somali 5 ,\nRoma, MAE, 1984.\nPuglielli, A e  R.Ajello “More on 'hybrid  verbs' in Somali”, in M. Bachhaus-\nGerst  and F. Se rzisko  (eds.), Cushitic-Omotic: Papers from the International\nSymposium on Cushitic  and Omotic Languages , Hamburg, Helmut Buske\nVerlag, 1988.\nPuglielli, A. e Abda lla Omar Mansur , Barashada Naxwaha Af Soomaaliga ,\nLondra, Haan Publisher,  1999.\nPuglielli, A. “ The structure of coordi nation in Somali”, in M. Hoehne and V.\nLulin (eds.), Milk and Peace, Drought and War.  Somali Culture, Society and\nPolitics , London, C. Hurst §Co Publishers LTD, 2010\nSaeed  John, Somali Syntax . London: John Be njamins, 1999."
    },
    {
      "page": 48,
      "text": "921 Hogatuska isrogrogga falalka\n\nA. Falalka dibkabayaasha leh\n\nIsrogrogga – I  CUN\n\n A M A R               M A S D A R\n\n  qaab diidmo  cuni\n2° ke. cun cunin\n2° w. cuna cunina\n\n HABKA EBYOON\n\n joogto caadaley qaab diidmo joogto socota qaab diidmo\n1° ke. cunaa ma cuno cunayaa ma cunayo\n2° ke. cuntaa ma cunto/cuntid cunaysaa ma cunayso/cunaysid\n3° ke.l cunaa ma cuno cunayaa ma cunayo\n3° ke.dh. cuntaa ma cunto cunaysaa ma cunayso\n1° w. cunnaa ma cunno cunaynaa ma cunayno\n2° w. cuntaan ma cuntaan cunaysaan ma cunaysaan\n3° w. cunaan ma cunaan cunayaan ma cunayaan\n\n\n tagto qaab diidmo tagto socota qaab diidmo\n1° ke. cunay ma cunin cunayay ma cunayn/cunaynin\n2° ke. cuntay ma cunin  cunaysay ma cunayn/cunaynin\n3° ke.l cunay ma cunin  cunayay ma cunayn/cunaynin\n3° ke.dh. cuntay ma cunin  cunaysay ma cunayn/cunaynin\n1° w. cunnay ma cunin  cunaynay ma cunayn/cunaynin\n2° w. cunteen ma cunin  cunayseen ma cunayn/cunaynin\n3° w. cuneen ma cunin  cunayeen ma cunayn/cunaynin\n\n\n tagto caadaley qaab diidmo\n1° ke. cuni jiray ma cuni jirin\n2° ke. cuni jirtay ma cuni jirin\n3° ke.l cuni jiray ma cuni jirin\n3° ke.dh. cuni jirtay ma cuni jirin\n1° w. cuni jirnay ma cuni jirin\n2° w. cuni jirteen ma cuni jirin\n3° w. cuni jireen ma cuni jirin\n\n"
    },
    {
      "page": 49,
      "text": "922  timaaddo qaab diidmo\n1° ke. cuni doonaa ma cuni doono\n2° ke. cuni doontaa ma cuni doonto/doontid\n3° ke.l cuni doonaa ma cuni doono\n3° ke.dh. cuni doontaa ma cuni doonto\n1° w. cuni doonnaa ma cuni doonno\n2° w. cuni doontaan ma cuni doontaan\n3° w. cuni doonaan ma cuni doonaan\n\n SHARDILEY\n  qaab diidmo\n1° ke. cuni lahaa ma cuneen\n2° ke. cuni lahayd ma cunteen\n3° ke.l cuni lahaa ma cuneen\n3° ke.dh. cuni lahayd ma cunteen\n1° w. cuni lahayn ma cunneen\n2° w. cuni lahaydeen ma cunteen\n3° w. cuni lahayeen ma cuneen\n\n HABKA DHIMMAN\n\n joogto dhimman qaab diidmo tagto dhimman qaab diidmo\n1° ke. (aan) cuno (aanan) cunin (aan) cunay (aanan) cunin\n2° ke. (aad) cunto/cuntid (aadan) cunin (aad) cuntay (aadan) cunin\n3° ke.l (uu) cuno (uusan) cunin (uu) cunay (uusan) cunin\n3° ke.dh. (ay) cunto (aysan) cunin (ay) cuntay (aysan) cunin\n1° w. (aan/aynu) cunno (aanan) cunin (aan/aynu) cunnay (aanan) cunin\n2° w. (aad) cuntaan (aadan) cunin (aad) cunteen (aadan) cunin\n3° w. (ay) cunaan (ayan) cunin (ay) cuneen (ayan) cunin\n\n HAB TALO\n  qaab diidmo\n1° ke. (an) cuno yaanan cunin\n2° ke. (ad) cunto yaanad cunin\n3° ke.l (ha) cuno yaanu/yuusan cunin\n3° ke.dh. (ha) cunto yaanay/yaysan cunin\n1° w. (aynu/an) cunno yaynu/yaanan cunin\n2° w. (ad) cunteen yaanad cunin\n3° w. (ha) cuneen yaanay/yaysan cunin\n\n\n"
    },
    {
      "page": 50,
      "text": "923 Isrogrogga – IIa  TOOSI\n\n A M A R               M A S D A R\n  qaab diidmo  toosin\n2° ke. toosi toosin\n2° w. toosiya toosinina\n\n HABKA EBYOON\n\n joogto caadaley qaab diidmo joogto socota qaab diidmo\n1° ke. toosiyaa ma toosiyo toosinayaa ma toosinayo\n2° ke. toosisaa ma toosiso /\ntoosisid toosinaysaa ma toosinayso /\ntoosinaysid\n3° ke.l toosiyaa ma toosiyo toosinayaa ma toosinayo\n3° ke.dh. toosisaa ma toosiso toosinaysaa ma toosinayso\n1° w. toosinaa ma toosino toosinaynaa ma toosinayno\n2° w. toosisaan ma toosisaan toosinaysaan ma toosinaysaan\n3° w. toosiyaan ma toosiyaan toosinayaan ma toosinayaan\n\n\n tagto qaab diidmo tagto socota qaab diidmo\n1° ke. toosiyay ma toosin toosinayay ma toosinayn/toosinaynin\n2° ke. toosisay ma toosin toosinaysay ma toosinayn/toosinaynin\n3° ke.l toosiyay ma toosin toosinayay ma toosinayn/toosinaynin\n3° ke.dh. toosisay ma toosin toosinaysay ma toosinayn/toosinaynin\n1° w. toosinay ma toosin toosinaynay ma toosinayn/toosinaynin\n2° w. toosiseen ma toosin toosinayseen ma toosinayn/toosinaynin\n3° w. toosiyeen ma toosin toosinayeen ma toosinayn/toosinaynin\n\n\n tagto caadaley qaab diidmo\n1° ke. toosin jiray ma toosin jirin\n2° ke. toosin jirtay ma toosin jirin\n3° ke.l toosin jiray ma toosin jirin\n3° ke.dh. toosin jirtay ma toosin jirin\n1° w. toosin jirnay ma toosin jirin\n2° w. toosin jirteen ma toosin jirin\n3° w. toosin jireen ma toosin jirin\n"
    },
    {
      "page": 51,
      "text": "924\n timaaddo qaab diidmo\n1° ke. toosin doonaa ma toosin doono\n2° ke. toosin doontaa ma toosin doonto/doontid\n3° ke.l toosin doonaa ma toosin doono\n3° ke.dh. toosin doontaa ma toosin doonto\n1° w. toosin doonnaa ma toosin doonno\n2° w. toosin doontaan ma toosin doontaan\n3° w. toosin doonaan ma toosin doonaan\n\n SHARDILEY\n\n  qaab diidmo\n1° ke. toosin lahaa ma toosiyeen\n2° ke. toosin lahayd ma toosiseen\n3° ke.l toosin lahaa ma toosiyeen\n3° ke.dh. toosin lahayd ma toosiseen\n1° w. toosin lahayn ma toosinneen\n2° w. toosin lahaydeen ma toosiseen\n3° w. toosin lahayeen ma toosiyeen\n\n HABKA DHIMMAN\n joogto dhimman qaab diidmo tagto dhimman qaab diidmo\n1° ke. (aan) toosiyo (aanan) toosin  (aan) toosiyay (aanan) toosin\n2° ke. (aad) toosiso /\ntoosisid (aadan) toosin (aad) toosisay (aadan) toosin\n3° ke.l (uu) toosiyo (uusan) toosin (uu) toosiyay (uusan) toosin\n3° ke.dh. (ay) toosiso (aysan) toosin (ay) toosisay (aysan) toosin\n1° w. (aan/aynu) toosinno (aanan) toosin (aan/aynu) toosinay (aanan) toosin\n2° w. (aad) toosisaan (aadan) toosin (aad) toosiseen (aadan) toosin\n3° w. (ay) toosiyaan (ayan) toosin (ay) toosiyeen (ayan) toosin\n\n HAB TALO\n\n  qaab diidmo\n1° ke. (an) toosiyo yaanan toosin\n2° ke. (ad) toosiso yaanad toosin\n3° ke.l (ha) toosiyo yaanu/yuusan toosin\n3° ke.dh. (ha) toosiso yaaney/yaysan toosin\n1° w. (aynu/an) toosinno yaynu/yaanan toosin\n2° w. (ad) toosiseen yaanad toosin\n3° w. (ha) toosiyeen yaaney/yaysan toosin\n"
    },
    {
      "page": 52,
      "text": "925 Isrogrogga – IIb  CADDEE\n\n A M A R               M A S D A R\n  qaab diidmo  caddayn\n2° ke. caddee Caddeyn\n2° w. caddeeya caddeynina\n\n HABKA EBYOON\n\n joogto caadaley qaab diidmo joogto socota qaab diidmo\n1° ke. caddeeyaa ma caddeeyo caddeynayaa ma caddeynayo\n2° ke. caddeysaa ma caddeeyso /\ncaddeeysid caddeynaysaa ma caddeynayso /\ncaddeynaysid\n3° ke.l caddeeyaa ma caddeeyo caddeynayaa ma caddeynayo\n3° ke.dh. caddeysaa ma caddeeyso caddeynaysaa ma caddeynayso\n1° w. caddeeyaa ma caddeyno caddeeynaynaa ma caddeeynayno\n2° w. caddeysaan ma caddeys aan caddeysaan ma caddeysaan\n3° w. caddeeyaan ma caddeeeyaan caddeeyaan ma caddeeyaan\n\n\n tagto qaab diidmo tagto socota qaab diidmo\n1° ke. caddeeyey ma caddeyn caddaynayay ma caddaynayn/caddaynaynin\n2° ke. caddeysay ma caddeyn caddeynaysay ma caddaynayn/caddaynaynin\n3° ke.l caddeeyey ma caddeyn caddenayay ma caddaynayn/caddaynaynin\n3° ke.dh. caddeysay ma caddeyn caddeynaysay ma caddaynayn/caddaynaynin\n1° w. caddeynay ma caddeyn caddaynaynay ma caddaynayn/caddaynaynin\n2° w. caddeyseen ma caddeyn caddaynayseen ma caddaynayn/caddaynaynin\n3° w. caddeeyeen ma caddeyn caddaynayeen ma caddaynayn/caddaynaynin\n\n\n tagto caadaley qaab diidmo\n1° ke. caddayn jiray ma caddayn jirin\n2° ke. caddayn jirtay ma caddayn jirin\n3° ke.l caddayn jiray ma caddayn jirin\n3° ke.dh. caddayn jirtay ma caddayn jirin\n1° w. caddayn jirnay ma caddayn jirin\n2° w. caddayn jirteen ma caddayn jirin\n3° w. caddayn jireen ma caddayn jirin\n"
    },
    {
      "page": 53,
      "text": "926\n timaaddo qaab diidmo\n1° ke. caddayn doonaa ma caddayn doono\n2° ke. caddayn doontaa ma caddayn doonto/doontid\n3° ke.l caddayn doonaa ma caddayn doono\n3° ke.dh. caddayn doontaa ma caddayn doonto\n1° w. caddayn doonnaa ma caddayn doonno\n2° w. caddayn doontaan ma caddayn doontaan\n3° w. caddayn doonaan ma caddayn doonaan\n\n SHARDILEY\n\n  qaab diidmo\n1° ke. caddayn lahaa ma caddeeyeen\n2° ke. caddayn lahayd ma caddeyseen\n3° ke.l caddayn lahaa ma caddeeyeen\n3° ke.dh. caddayn lahayd ma caddayseen\n1° w. caddayn lahayn ma caddaynayn\n2° w. caddayn lahaydeen ma caddayseen\n3° w. caddayn lahayeen ma caddeeyeen\n\n HABKA DHIMMAN\n joogto dhimman qaab diidmo tagto dhimman qaab diidmo\n1° ke. (aan) caddeeyo (aanan) caddayn (aan) caddeeyay (aanan) caddayn\n2° ke. (aad) caddeyso /\ncaddeysid (aadan) caddayn (aad) caddeysay (aadan) caddayn\n3° ke.l (uu) caddeeyo (uusan) caddayn (uu) caddeeyay (uusan) caddayn\n3° ke.dh. (ay) caddeyso (aysan) caddayn (ay) caddaysay (aysan) caddayn\n1° w. (aan/aynu) caddeyno (aanan) cadda yn (aan) caddaynay (aanan) caddayn\n2° w. (aad) caddeysaan (aadan) caddayn (aad) caddayseen (aadan) caddayn\n3° w. (ay) caddeeyaan (ayan) caddayn (ay) caddeeyeen (ayan) caddayn\n\n HAB TALO\n\n  qaab diidmo\n1° ke. (an) caddeeyo yaanan caddaynin\n2° ke. (ad) caddeyso yaanad caddaynin\n3° ke.l (ha) caddeeyo yaanu/yuusan caddaynin\n3° ke.dh. (ha) caddeyso yaaney/yaysan caddaynin\n1° w. (aynu/an) caddeyno yaynu/yaanan caddaynin\n2° w. (ad) caddeyseen yaanad caddaynin\n3° w. (ha) caddeeyeen yaaney/yaysan caddaynin\n"
    },
    {
      "page": 54,
      "text": "927 Isrogrogga – IIIa  DHAQO\n\n A M A R               M A S D A R\n  qaab diidmo  dhaqan\n2° ke. dhaqo dhaqan\n2° w. dhaqda dhaqanina\n\n HABKA EBYOON\n\n joogto caadaley qaab diidmo joogto socota qaab diidmo\n1° ke. dhaqdaa ma dhaqdo dhaqanayaa ma dhaqanayo\n2° ke. dhaqataa ma dhaqato /\ndhaqatid dhaqanaysaa ma dhaqanayso /\ndhaqanaysid\n3° ke.l dhaqdaa ma dhaqdo dhaqanayaa ma dhaqanayo\n3° ke.dh. dhaqataa ma dhaqato dhaqanaysaa ma dhaqanayso\n1° w. dhaqannaa ma dhaqanno dhaqanaynaa ma dhaqanayno\n2° w. dhaqataan ma dhaqataan dhaqanaysaan ma dhaqanaysaan\n3° w. dhaqdaan ma dhaqadaan dhaqanayaan ma dhaqanayaan\n\n\n tagto qaab diidmo tagto socota qaab diidmo\n1° ke. dhaqday ma dhaqan dhaqanayay ma dhaqanayn/dhaqanaynin\n2° ke. dhaqatay ma dhaqan dhaqanaysay ma dhaqanayn/dhaqanaynin\n3° ke.l dhaqday ma dhaqan dhaqanayay ma dhaqanayn/dhaqanaynin\n3° ke.dh. dhaqatay ma dhaqan dhaqanaysay ma dhaqanayn/dhaqanaynin\n1° w. dhaqannay ma dhaqan dhaqanaynay ma dhaqanayn/dhaqanaynin\n2° w. dhaqateen ma dhaqan dhaqanayseen ma dhaqanayn/dhaqanaynin\n3° w. dhaqdeen ma dhaqan dhaqanayeen ma dhaqanayn/dhaqanaynin\n\n\n tagto caadaley qaab diidmo\n1° ke. dhaqan jiray ma dhaqan jirin\n2° ke. dhaqan jirtay ma dhaqan jirin\n3° ke.l dhaqan jiray ma dhaqan jirin\n3° ke.dh. dhaqan jirtay ma dhaqan jirin\n1° w. dhaqan jirnay ma dhaqan jirin\n2° w. dhaqan jirteen ma dhaqan jirin\n3° w. dhaqan jireen ma dhaqan jirin\n"
    },
    {
      "page": 55,
      "text": "928\n timaaddo qaab diidmo\n1° ke. dhaqan doonaa ma dhaqan doono\n2° ke. dhaqan doontaa ma dhaqan doonto/doontid\n3° ke.l dhaqan doonaa ma dhaqan doono\n3° ke.dh. dhaqan doontaa ma dhaqan doonto\n1° w. dhaqan doonnaa ma dhaqan doonno\n2° w. dhaqan doontaan ma dhaqan doontaan\n3° w. dhaqan doonaan ma dhaqan doonaan\n\n SHARDILEY\n\n  qaab diidmo\n1° ke. dhaqan lahaa ma dhaqdeen\n2° ke. dhaqan lahayd ma dhaqateen\n3° ke.l dhaqan lahaa ma dhaqdeen\n3° ke.dh. dhaqan lahayd ma dhaqateen\n1° w. dhaqan lahayn ma dhaqanneen\n2° w. dhaqan lahaydeen ma dhaqateen\n3° w. dhaqan lahayeen ma dhaqdeen\n\n HABKA DHIMMAN\n joogto dhimman qaab diidmo tagto dhimman qaab diidmo\n1° ke. (aan) dhaqdo (aanan) dhaqan (aan) dhaqday (aanan) dhaqan\n2° ke. (aad)\ndhaqato/dhaqatid (aadan) dhaqan (aad) dhaqatay (aadan) dhaqan\n3° ke.l (uu) dhaqdo (uusan) dhaqan (uu) dhaqday (uusan) dhaqan\n3° ke.dh. (ay) dhaqato (aysan) dhaqan (ay) dhaqatay (aysan) dhaqan\n1° w. (aan/aynu) dhaqanno (aanan) dhaqan (aan) dhaqannay (aanan) dhaqan\n2° w. (aad) dhaqataan (aadan) dhaqan (aad) dhaqateen (aadan) dhaqan\n3° w. (ay) dhaqdaan (ayan) dhaqan (ay) dhaqdeen (ayan) dhaqan\n\n HAB TALO\n\n  qaab diidmo\n1° ke. (an) dhaqdo yaanan dhaqanin\n2° ke. (ad) dhaqato yaanad dhaqanin\n3° ke.l (ha) dhaqdo yaanu/yuusan dhaqanin\n3° ke.dh. (ha) dhaqato yaaney/yaysan dhaqanin\n1° w. (aynu/an) dhaqanno yaynu/yaanan dhaqanin\n2° w. (ad) dhaqateen yaanad dhaqanin\n3° w. (ha) dhaqdeen yaaney/yaysan dhaqanin\n"
    },
    {
      "page": 56,
      "text": "929 Isrogrogga – IIIb  QABSO\n\n A M A R               M A S D A R\n  qaab diidmo  qabsan\n2° ke. qabso qabsan\n2° w. qabsada qabsanina\n\n HABKA EBYOON\n\n joogto caadaley qaab diidmo joogto socota qaab diidmo\n1° ke. qabsadaa ma qabsado qabsanayaa ma qabsanayo\n2° ke. qabsataa ma qabsato/\nqabsatid qabsanaysaa ma qabsanayso/\nqabsanaysid\n3° ke.l qabsadaa ma qabsado qabsanayaa ma qabsanayo\n3° ke.dh. qabsataa ma qabsato qabsanaysaa ma qabsanayso\n1° w. qabsannaa ma qabsanno qabsanaynaa ma qabsanayno\n2° w. qabsataan ma qabsataan qabsanaysaan ma qabsanaysaan\n3° w. qabsadaan ma qabsadaan qabsanayaan ma qabsanayaan\n\n\n tagto qaab diidmo tagto socota qaab diidmo\n1° ke. qabsaday ma qabsan qabsanayay ma qabsanayn/qabsanaynin\n2° ke. qadsatay ma qabsan qadsanaysay ma qabsanayn/qabsanaynin\n3° ke.l qabsaday ma qabsan qabsanayay ma qabsanayn/qabsanaynin\n3° ke.dh. qabsatay ma qabsan qabsanaysay ma qabsanayn/qabsanaynin\n1° w. qabsannay ma qabsan qabsanaynay ma qabsanayn/qabsanaynin\n2° w. qabsateen ma qabsan qabsanyaseen ma qabsanayn/qabsanaynin\n3° w. qabsadeen ma qabsan qabsanayeen ma qabsanayn/qabsanaynin\n\n\n tagto caadaley qaab diidmo\n1° ke. qabsan jiray ma qabsan jirin\n2° ke. qabsan jirtay ma qabsan jirin\n3° ke.l qabsan jiray ma qabsan jirin\n3° ke.dh. qabsan jirtay ma qabsan jirin\n1° w. qabsan jirnay ma qabsan jirin\n2° w. qabsan jirteen ma qabsan jirin\n3° w. qabsan jireen ma qabsan jirin\n"
    },
    {
      "page": 57,
      "text": "930\n timaaddo qaab diidmo\n1° ke. qabsan doonaa ma qabsan doono\n2° ke. qabsan doontaa ma qabsan doonto/doontid\n3° ke.l qabsan doonaa ma qabsan doono\n3° ke.dh. qabsan doontaa ma qabsan doonto\n1° w. qabsan doonnaa ma qabsan doonno\n2° w. qabsan doontaan ma qabsan doontaan\n3° w. qabsan doonaan ma qabsan doonaan\n\n SHARDILEY\n  qaab diidmo\n1° ke. qabsan lahaa ma qabsadeen\n2° ke. qabsan lahayd ma qabsateen\n3° ke.l qabsan lahaa ma qabsadeen\n3° ke.dh. qabsan lahayd ma qabsateen\n1° w. qabsan lahayn ma qabsaneen\n2° w. qabsan lahaydeen ma qabsateen\n3° w. qabsan lahayeen ma qabsadeen\n\n HABKA DHIMMAN\n\n joogto dhimman qaab diidmo tagto dhimman qaab diidmo\n1° ke. (aan) qabsado (aanan) qabsan (aan) qabsaday (aanan) qabsan\n2° ke. (aad) qabsato/\nqabsatid (aadan) qabsan (aad) qabsatay (aadan) qabsan\n3° ke.l (uu) qabsado (uusan) qabsan (uu) qabsaday (uusan) qabsan\n3° ke.dh. (ay) qabsato (aysan) qabsan (ay) qabsatay (aysan) qabsan\n1° w. (aan/aynu) qabsanno (aanan) qabsan (aan) qabsannay (aanan) qabsan\n2° w. (aad) qabsataan (aadan) qabsan (aad) qabsateen (aadan) qabsan\n3° w. (ay) qabsadaan (ayan) qabsan (ay) qabsadeen (ayan) qabsan\n\n HAB TALO\n\n  qaab diidmo\n1° ke. (an) qabsado yaanan qabsanin\n2° ke. (ad) qabsato yaanad qabsanin\n3° ke.l (ha) qabsado yaanu/yuusan qabsanin\n3° ke.dh. (ha) qabsato yaaney/yaysan qabsanin\n1° w. (aynu/an) qabsanno yaynu/yaanan qabsanin\n2° w. (ad) qabsateen yaanad qabsanin\n3° w. (ha) qabsadeen yaaney/yaysan qabsanin\n"
    },
    {
      "page": 58,
      "text": "931 Isrogrogga – IVa  (FAL SIFO) ADAG\n\n HABKA EBYOON\n joogto  qaab diidmo\n1° ke. adkahay ma adki\n2° ke. adagtahay ma adkid\n3° ke.l adagyahay ma adka\n3° ke.dh. adagtahay ma adka\n1° w. adagnahay ma adkin\n2° w. adagtihiin ma adkidin\n3° w. adagyihiin ma adka\n\n\n tagto qaab diidmo tagto caadaley qaab diidmo\n1° ke. adkaa ma adkayn adkaan jiray ma adkaan jirin\n2° ke. adkayd ma adkayn adkaan jirtay ma adkaan jirin\n3° ke.l adkaa ma adkayn adkaan jiray ma adkaan jirin\n3° ke.dh. adkayd ma adkayn adkaan jirtay ma adkaan jirin\n1° w. adkayn ma adkayn adkaan jirnay ma adkaan jirin\n2° w. adkaydeen ma adkayn adkaan jirteen ma adkaan jirin\n3° w. adkayeen ma adkayn adkaan jireen ma adkaan jirin\n\n\n timaaddo qaab diidmo\n1° ke. adkaan doonaa ma adkaan doono\n2° ke. adkaan doontaa ma adkaan doonto\n3° ke.l adkaan doonaa ma adkaan doono\n3° ke.dh. adkaan doontaa ma adkaan doonto\n1° w. adkaan doonnaa ma adkaan doonno\n2° w. adkaan doontaan ma adkaan doontaan\n3° w. adkaan doonaan ma adkaan doonaan\n\n SHARDILEY\n\n  qaab diidmo\n1° ke. adkaan lahaa ma adkaadeen\n2° ke. adkaan lahayd ma adkaateen\n3° ke.l adkaan lahaa ma adkaadeen\n3° ke.dh. adkaan lahayd ma adkaateen\n1° w. adkaan lahayn ma adkaanneen\n2° w. adkaan lahaydeen ma adkaateen\n3° w. adkaan lahayeen ma adkaadeen\n"
    },
    {
      "page": 59,
      "text": "932  HABKA DHIMMAN\n\n joogto dhimman qaab diidmo tagto dhimman qaab diidmo\n1° ke. in aan adkahay in aanan adka yn in aan adkaa in aanan adkayn\n2° ke. in aad adagtahay in aadan adka yn in aad adkayd in aadan adkayn\n3° ke.l in uu adagyahay in uusan adkayn in uu adkaa in uusan adkayn\n3° ke.dh. in ay adagtahay in aysan adkayn in ay adkayd in aysan adkayn\n1° w. in aan adagnahay in aanan adka yn in aan adkayn in aanan adkayn\n2° w. in aad adagtihiin in aadan adka yn in aad adkaydeen in aadan adkayn\n3° w. in ay adagyihiin in ayan adkayn in ay adkayeen in ayan adkayn\n\n\nIsrogrogga – IVb  FIICAN\n  HABKA EBYOON\n joogto  qaab diidmo\n1° ke. fiicnahay ma fiicni\n2° ke. fiicantahay ma fiicnid\n3° ke.l fiicanyahay ma fiicna\n3° ke.dh. fiicantahay ma fiicna\n1° w. fiicannahay ma fiicnin\n2° w. fiicantihiin ma fiicnidin\n3° w. fiicanyihiin ma fiicna\n\n\n tagto qaab diidmo tagto caadaley qaab diidmo\n1° ke. fiicnaa ma fiicnayn ficnaan jiray ma ficnaan jirin\n2° ke. fiicnayd ma fiicnayn ficnaan jirtay ma ficnaan jirin\n3° ke.l fiicnaa ma fiicnayn ficnaan jiray ma ficnaan jirin\n3° ke.dh. fiicnayd ma fiicnayn ficnaan jirtay ma ficnaan jirin\n1° w. fiicnayn ma fiicnayn ficnaan jirnay ma ficnaan jirin\n2° w. fiicnaydeen ma fiicnayn ficnaan jirteen ma ficnaan jirin\n3° w. fiicnayeen ma fiicnayn ficnaan jireen ma ficnaan jirin\n\n\n timaaddo qaab diidmo\n1° ke. ficnaan doonaa ma fiicnaan doono\n2° ke. ficnaan doontaa ma fiicnaan doonto\n3° ke.l ficnaan doonaa ma fiicnaan doono\n3° ke.dh. ficnaan doontaa ma fiicnaan doonto\n1° w. ficnaan doonnaa ma fiicnaan doonno\n2° w. ficnaan doontaan ma fiicnaan doontaan\n3° w. ficnaan doonaan ma fiicnaan doonaan"
    },
    {
      "page": 60,
      "text": "933  SHARDILEY\n\n  qaab diidmo\n1° ke. fiicnaa lah aa ma fiicnaadeen\n2° ke. fiicnaa lahayd ma fiicnaateen\n3° ke.l fiicnaa la haa ma fiicnaadeen\n3° ke.dh. fiicnaa lahayd ma fiicnaateen\n1° w. fiicnaa lahayn ma fiicnaanneen\n2° w. fiicnaa lahaydeen ma fiicnaateen\n3° w. fiicnaa lahayeen ma fiicnaadeen\n\n HABKA DHIMMAN\n\n joogto dhimman qaab diidmo tagto dhimman qaab diidmo\n1° ke. in aan fiicnahay in aanan fiicna yn in aan fiicnaa in aanan fiicnayn\n2° ke. in aad fiicantahay in aadan fiicna yn in aad fiicnayd in aadan fiicnayn\n3° ke.l in uu fiicanyahay in uusan fiicnayn in uu fiicnaa in uusan fiicnayn\n3° ke.dh. in ay fiicantahay in aysan fiic nayn in ay fiicnayd in aysan fiicnayn\n1° w. in aan fiicannahay in aanan fiicna yn in aan fiicnayn in aanan fiicnayn\n2° w. in aad fiicantihiin in aadan fiicna yn in aad fiicnaydeen in aadan fiicnayn\n3° w. in ay fiicanyihiin in ayan fiicnayn in ay fiicnayeen in ayan fiicnayn\n\nB. Falal horkabayaal leh (o shan ah)\n\nAQAAN\n MASDAR\n\naqoon\n\n\n HABKA EBYOON\n\n joogto caadaley qaab diidmo\n1° ke. aqaan ma aqaan\n2° ke. taqaan ma taqaan\n3° ke.l yaqaan ma yaqaan\n3° ke.dh. taqaan ma taqaan\n1° w. naqaan ma naqaan\n2° w. taqaaniin ma taqaaniin\n3° w. yaqaaniin ma yaqaaniin\n"
    },
    {
      "page": 61,
      "text": "934\n tagto qaab diidmo tagto caadaley qaab diidmo\n1° ke. iqiin ma aqoon (in) aqoon jiray ma aqoon jirin\n2° ke. tiqiin ma aqoon (in) aqoon jirtay ma aqoon jirin\n3° ke.l yiqiin ma aqoon (in) aqoon jiray ma aqoon jirin\n3° ke.dh. tiqiin ma aqoon (in) aqoon jirtay ma aqoon jirin\n1° w. niqiin ma aqoon (in) aqoon jirnay ma aqoon jirin\n2° w. tiqiineen ma aqoon (in) aqoon jirteen ma aqoon jirin\n3° w. yiqiineen ma aqoon (in) aqoon jireen ma aqoon jirin\n\n\n timaaddo qaab diidmo\n1° ke. aqoon doonaa ma aqoon doono\n2° ke. aqoon doontaa ma aqoon doonto\n3° ke.l aqoon doonaa ma aqoon doono\n3° ke.dh. aqoon doontaa ma aqoon doonto\n1° w. aqoon doonnaa ma aqoon doonno\n2° w. aqoon doontaan ma aqoon doontaan\n3° w. aqoon doonaan ma aqoon doonaan\n\n SHARDILEY\n\n  qaab diidmo\n1° ke. aqoon lahaa ma aqaanneen\n2° ke. aqoon lahayd ma taqaanneen\n3° ke.l aqoon lahaa ma yaqaanneen\n3° ke.dh. aqoon lahayd ma taqaanneen\n1° w. aqoon lahayn ma naqaanneen\n2° w. aqoon lahaydeen ma taqaaneen\n3° w. aqoon lahayeen ma yaqaanneen\n\n HABKA DHIMMAN\n joogto dhimman qaab diidmo tagto dhimman qaab diidmo\n1° ke. aan aqaanno aanan a qoon aan iqiin aanan aqiin\n2° ke. aad taqaanno aadan aqoon aad tiqiin aadan aqiin\n3° ke.l uu yaqaanno uusan a qoon uu yiqiin uusan aqiin\n3° ke.dh. ay taqaanno aysan a qoon ay tiqiin aysan aqiin\n1° w. aan/aynu naqaanno   aanan/aynan\naqoon aan/aynu niqin aanan/aynan\naqiin\n2° w. aad taqaanaan aydan aqoon aad tiqiineen aydan aqiin\n3° w. ay yaqaanaan ayan aqoon ay yiqiineen ayan aqiin\n"
    },
    {
      "page": 62,
      "text": "935  HAB TALO\n\n  qaab diidmo\n1° ke. an aqaanno yaanan a qoon\n2° ke. ad taqaanno yaanad a qoon\n3° ke.l ha yaqaanno yaanu/yuusan a qoon\n3° ke.dh. ha taqaanno yaaney/yaysan a qoon\n1° w. an/aynu naqaanno yaynu/yaanan a qoon\n2° w. ad taqaanaan  yaanad aqoon\n3° w. ay yaqaanaan yaaney/yaysan aqoon\n\n\nAAL\n\n MASDAR\nOolli\n\n\n HABKA EBYOON\n joogto caadaley qaab diidmo\n1° ke. aal (aallaa) ma aal\n2° ke. taal (taallaa) ma taal\n3° ke.l yaal (yaallaa) ma yaal\n3° ke.dh. taal (taallaa) ma taal\n1° w. naal (naallaa) ma naal\n2° w. taalliin (taallaan) ma taalliin\n3° w. yaalliin (yaallaan) ma yaalliin\n\n\n tagto qaab diidmo tagto caadaley qaab diidmo\n1° ke. iil/iillay ma ool (in) oolli jiray ma oolli jirin\n2° ke. tiil/tiillay ma ool (in) oolli jirtay ma oolli jirin\n3° ke.l yiil/yiillay ma ool (in) oolli jiray ma oolli jirin\n3° ke.dh. tiil/tiillay ma ool (in) oolli jirtay ma oolli jirin\n1° w. niil/niillay ma ool (in) oolli jirnay ma oolli jirin\n2° w. tiilleen ma ool (in) oolli jirteen ma oolli jirin\n3° w. yiilleen ma ool (in) oolli jireen ma oolli jirin\n"
    },
    {
      "page": 63,
      "text": "936\n timaaddo qaab diidmo\n1° ke. oolli doonaa oolli doono\n2° ke. oolli doontaa oolli doonto\n3° ke.l oolli doonaa oolli doono\n3° ke.dh. oolli doontaa oolli doonto\n1° w. oolli doonnaa oolli doonno\n2° w. oolli doontaan oolli doontaan\n3° w. oolli doonaan oolli doonaan\n\n SHARDILEY\n  qaab diidmo\n1° ke. oolli lahaa ma aalleen\n2° ke. oolli lahayd ma taalleen\n3° ke.l oolli lahaa ma yaalleen\n3° ke.dh. oolli lahayd ma taalleen\n1° w. oolli lahayn ma naalleen\n2° w. oolli lahaydeen ma taalleen\n3° w. oolli lahayeen ma yaalleen\n\n HABKA DHIMMAN\n\n joogto dhimman qaab diidmo tagto dhimman qaab diidmo\n1° ke. aan aallo aanan oollin aan iil/iillay aanan iil\n2° ke. aad taallo aadan oollin aad tiil/tiillay aadan iil\n3° ke.l uu yaallo uusan oollin uu yiil/yillay uusan iil\n3° ke.dh. ay taallo aysan oollin ay tiil/tiillay aysan iil\n1° w. aan/aynu naallo aanan/aynan\noollin aan/aynu\nniil/niillay aanan/aynan iil\n2° w. aad taallaan aydan oollin aynu   “ aydan iil\n3° w. ay yaallaan ayan oollin aad tiilleen ayan iil\n\n HAB TALO\n\n  qaab diidmo\n1° ke. an aallo yaanan oolin\n2° ke. ad taallo yaanad oolin\n3° ke.l ha yaallo yaanu/yuusan oolin\n3° ke.dh. ha taallo yaaney/yaysan oolin\n1° w. an/aynu naallo yaanan/yaynu oolin\n2° w. ad taalleen yaanad oolin\n3° w. ha yaalleen yaaney/yaysan oolin\n"
    },
    {
      "page": 64,
      "text": "937 DHEH\n\n A M A R               M A S D A R\n  qaab diidmo  dhihi/oran\n2° ke. dheh dhihin\n2° w. dhaha dhihina\n\n HABKA EBYOON\n\n joogto\ncaadaley qaab diidmo joogto\nsocota qaab diidmo\n1° ke. iraahdaa ma iraahdo oranayaa ma oranayo/odhan maayo\n2° ke. tiraahdaa ma tiraahdo oranaysaa ma oranayso/odhan mayso\n3° ke.l yiraahdaa ma yiraahdo oranayaa ma oranayo/odhan maayo\n3° ke.dh. tiraahdaa ma tiraahdo oranaysaa ma oranayso/odhan mayso\n1° w. niraahdaa ma niraahdo oranaynaa ma oranayno/odhan mayno\n2° w. tiraahdaan ma tiraahdaan oranaysaan ma oranaysaan/odhan maysaan\n3° w. yiraahdaan ma yiraahdaan oranayaan ma oranayaan/odhan maayaan\n\n\n tagto qaab diidmo tagto socota qaab diidmo\n1° ke. iri ma oran (in) oranayay ma oranayn (in)\n2° ke. tiri ma oran (in) oranaysay ma oranayn (in)\n3° ke.l yiri ma oran (in) oranayay ma oranayn (in)\n3° ke.dh. tiri ma oran (in) oranaysay ma oranayn (in)\n1° w. niri ma oran (in) oranaynay ma oranayn (in)\n2° w. tiraahdeen ma oran (in) oranayseen ma oranayn (in)\n3° w. yiraahdeen ma oran (in) oranayeen ma oranayn (in)\n\n\n tagto caadaley qaab diidmo\n1° ke. oran jiray ma oran jirin\n2° ke. oran jirtay ma oran jirin\n3° ke.l oran jiray ma oran jirin\n3° ke.dh. oran jirtay ma oran jirin\n1° w. oran jirnay ma oran jirin\n2° w. oran jirteen ma oran jirin\n3° w. oran jireen ma oran jirin\n"
    },
    {
      "page": 65,
      "text": "938\n timaaddo qaab diidmo\n1° ke. oran doonaa ma oran doono\n2° ke. oran doontaa ma oran doonto\n3° ke.l oran doonaa ma oran doono\n3° ke.dh. oran doontaa ma oran doonto\n1° w. oran doonnaa ma oran doonno\n2° w. oran doontaan ma oran doontaan\n3° w. oran doonaan ma oran doonaan\n\n SHARDILEY\n  qaab diidmo\n1° ke. oran lahaa ma iraahdeen\n2° ke. oran lahayd ma tiraahdeen\n3° ke.l oran lahaa ma yiraahdeen\n3° ke.dh. oran lahayd ma tiraahdeen\n1° w. oran lahayn ma niraahdeen\n2° w. oran lahaydeen ma tiraahdeen\n3° w. oran lahayeen ma yiraahdeen\n\n\n HABKA DHIMMAN\n joogto dhimman qaab diidmo tagto dhimman qaab diidmo\n1° ke. aan iraahdo aanan oran aan iri aanan oran\n2° ke. aad tiraahdo aadan oran aad tiri aadan oran\n3° ke.l uu yiraahdo uusan oran uu yiri uusan oran\n3° ke.dh. ay tiraahdo aysan oran ay tiri aysan oran\n1° w. aan/aynu niraahdo aanan/aynan oran aan/aynu niri aanan/aynan oran\n2° w. ad tiraahdaan aydan oran aad tiraahdeen ayadan oran\n3° w. ay yiraahdaan ayan oran ay yiraahdeen ayan oran\n\n HAB TALO\n\n  qaab diidmo\n1° ke. an iraahdo yaanan oran\n2° ke. ad tiraahdo yaanad oran\n3° ke.l ha yiraahdo yaanu/yuusan oran\n3° ke.dh. ha tiraahdo yaaney/yaysan oran\n1° w. an/aynu niraahdo yaanan/yaynu oran\n2° w. ad tiraahdeen yaanad oran\n3° w. ha yiraahdeen yaaney/yaysan oran\n"
    },
    {
      "page": 66,
      "text": "939 IMOW\n\n A M A R               M A S D A R\n  qaab diidmo  iman\n2° ke. imow iman/imaanin\n2° w. imaada imaanina\n\n HABKA EBYOON\n\n joogto\ncaadaley qaab diidmo joogto socota qaab diidmo\n1° ke. imaaddaa ma imaaddo imanayaa ma imanayo/iman maayo\n2° ke. timaaddaa ma timaaddo imanaysaa ma imanayso/iman mayso\n3° ke.l yimaaddaa ma yimaaddo imanayaa ma imanayo/iman maayo\n3° ke.dh. timaaddaa ma timaaddo imanaysaa ma imanayso/iman mayso\n1° w. nimaaddaa ma nimaaddo imanaynaa ma imanayno/iman mayno\n2° w. timaaddaan ma timaaddaan imanaysaan ma imanaysaan/iman\nmaysaan\n3° w. yimaaddaan ma yimaaddaan imanayaan ma imanayaan/iman\nmaayaan\n\n\n tagto qaab diidmo tagto socota qaab diidmo\n1° ke. imi (d) ma iman (in) imanayay ma imanayn (in)\n2° ke. timi (d) ma iman (in) imanaysay ma imanayn (in)\n3° ke.l yimi (d) ma iman (in) imanayay ma imanayn (in)\n3° ke.dh. timi (d) ma iman (in) imanaysay ma imanayn (in)\n1° w. nimi (d) ma iman (in) imanaynay ma imanayn (in)\n2° w. timaaddeen ma iman (in) imanayseen ma imanayn (in)\n3° w. yimaaddeen ma iman (in) imanayeen ma imanayn (in)\n\n\n tagto caadaley qaab diidmo\n1° ke. imaan jiray ma imaan jirin\n2° ke. imaan jirtay ma imaan jirin\n3° ke.l imaan jiray ma imaan jirin\n3° ke.dh. imaan jirtay ma imaan jirin\n1° w. imaan jirnay ma imaan jirin\n2° w. imaan jirteen ma imaan jirin\n3° w. imaan jireen ma imaan jirin\n"
    },
    {
      "page": 67,
      "text": "940\n timaaddo qaab diidmo\n1° ke. imaan doonaa ma imaan doono\n2° ke. imaan doontaa ma imaan doonto\n3° ke.l imaan doonaa ma imaan doono\n3° ke.dh. imaan doontaa ma imaan doonto\n1° w. imaan doonnaa ma imaan doonno\n2° w. imaan doontaan ma imaan doontaan\n3° w. imaan doonaan ma imaan doonaan\n\n SHARDILEY\n  qaab diidmo\n1° ke. imaan lahaa ma imaadeen\n2° ke. imaan lahayd ma timaadeen\n3° ke.l imaan lahaa ma yimaadeen\n3° ke.dh. imaan lahayd ma timaadeen\n1° w. imaan lahayn ma nimaadeen\n2° w. imaan lahaydeen ma timaadeen\n3° w. imaan lahayeen ma yimaadeen\n\n HABKA DHIMMAN\n\n joogto dhimman qaab diidmo tagto dhimman qaab diidmo\n1° ke. aan imaaddo aanan iman aan imid aanan iman\n2° ke. aad timaaddo aadan iman aad timid aadan iman\n3° ke.l uu yimaaddo uusan iman uu yimid uusan iman\n3°ke.dh. ay timaaddo aysan iman ay timid aysan iman\n1° w. aan/aynu nimaaddo aanan/aynan iman aan/aynu nimid aanan/aynan iman\n2° w. aad timaaddaan aydan iman aad timaaddee aydan iman\n3° w. ay yimaadaan ayan iman ay yimaaddeen ayan iman\n\n HAB TALO\n  qaab diidmo\n1° ke. an imaaddo yaanan iman\n2° ke. ad timaaddo yaanad iman\n3° ke.l ha yimaaddo yaanu/yuusan iman\n3° ke.dh. ha timaaddo yaaney/yaysan iman\n1° w. an/aynu nimaadno yaynu/yaanan iman\n2° w. ad timaaddeen yaanad iman\n3° w. ha yimaaddeen yaaney/yaysan iman\n\n"
    },
    {
      "page": 68,
      "text": "941 AH\n\n A M A R               M A S D A R\n  qaab diidmo  ahaan\n2° ke. ahaw ahaanin\n2° w. ahaada ahaanina\n\n HABKA EBYOON\n\n joogto caadaley qaab diidmo joogto socota qaab diidmo\n1° ke. ahay ma ihi ahanayaa ma ahanayo\n2° ke. tahay ma tihid ahanaysaa ma ahanayso\n3° ke.l yahay ma aha ahanayaa ma ahanayo\n3° ke.dh. tahay ma aha ahanaysaa ma ahanayso\n1° w. nahay ma nihin ahanaynaa ma ahanayno\n2° w. tihiin ma tihin ahanaysaan ma ahanaysaan\n3° w. yihiin ma aha ahanayaan ma ahanayaan\n\n\n tagto qaab diidmo tagto caadaley qaab diidmo\n1° ke. ahaa ma ahayn ahaan jiray ma ahaan jirin\n2° ke. ahayd ma ahayn ahaan jirtay ma ahaan jirin\n3° ke.l ahaa ma ahayn ahaan jiray ma ahaan jirin\n3° ke.dh. ahayd ma ahayn ahaan jirtay ma ahaan jirin\n1° w. ahayn ma ahayn ahaan jirnay ma ahaan jirin\n2° w. ahaydeen ma ahayn ahaan jirteen ma ahaan jirin\n3° w. ahayeen ma ahayn ahaan jireen ma ahaan jirin\n\n\n timaaddo qaab diidmo\n1° ke. ahaan doonaa ma ahaan doono\n2° ke. ahaan doontaa ma ahaan doonto\n3° ke.l ahaan doonaa ma ahaan doono\n3° ke.dh. ahaan doontaa ma ahaan doonto\n1° w. ahaan doonnaa ma ahaan doonno\n2° w. ahaan doontaan ma ahaan doontaan\n3° w. ahaan doonaan ma ahaan doonaan\n"
    },
    {
      "page": 69,
      "text": "942  SHARDILEY\n\n  qaab diidmo\n1° ke. ahaan lahaa ma ahaadeen\n2° ke. ahaan lahayd ma ahaadeen\n3° ke.l ahaan lahaa ma ahaadeen\n3° ke.dh. ahaan lahayd ma ahaadeen\n1° w. ahaan lahayn ma ahaadeen\n2° w. ahaan lahaydeen ma ahaadeen\n3° w. ahaan lahayeen ma ahaadeen\n\n HABKA DHIMMAN\n\n joogto dhimman qaab diidmo tagto dhimman qaab diidmo\n1° ke. aan ahaado aanan ahaan aan ahaa aanan ahayn\n2° ke. aad ahaato aadan ahaan aad ahayd aadan ahayn\n3° ke.l uu ahaado uusan ahaan uu ahaa uusan ahayn\n3° ke.dh. ay ahaato aysan ahaan ay ahayd aysan ahayn\n1° w. aan/aynu ahaanno aanan/aynan ahaan aan/aynu ahayn aynan/aynan\nahayn\n2° w. aad ahaataan aydan ahaan aad ahaydeen aydan ahayn\n3° w. ay ahaadaan ayan ahaan ay ahaayeen ayan ahayn\n\n HAB TALO\n\n  qaab diidmo\n1° ke. an ahaado yaanan ahaan\n2° ke. ad ahaatid yaanad ahaan\n3° ke.l ha ahaato yaanu/yuusan ahaan\n3° ke.dh. ha ahaato yaaney/yaysan ahaan\n1° w. an/aynu ahaanno yaynu/yaanan ahaan\n2° w. ad ahaateen yaanad ahaan\n3° w. ha ahaadeen yaaney/yaysan ahaan"
    },
    {
      "page": 70,
      "text": "943 Habka ay isugu dhafm aan horyaallada\niyo magacuyaallada layeelaha ahi\n\n\n Laba horyaale oo iskudhafan\nu + ku\n = ugu\nu + ka  = uga\nu + la  = ula\nku + ka  = kaga\nku + la  = kula\nka + ka  = kaga\nka + la  = kala\n\nTus.:\nXaggee baad kala timid buugan?\nBaabuurkii baan guriga aayar uga soo saaray\n\nHoryaallada iyo magacuyaallada layeele ah oo isku dhafan\n\ni + u = ii\ni + ku  = igu\ni + ka  = iga\ni + la  = ila\n\nku + u  = kuu\nku + ku  = kugu\nku + ka  = kaa\nku + la  = kula\n\nna + u  = noo\nna + ku  = nagu\nna + ka  = naga\nna + la  = nala\n\nina + u  = inoo\nina + ku  = inagu\nina + ka  = inaga"
    },
    {
      "page": 71,
      "text": "944 ina + la = inala\n\nidin + u = idiin\nidin + ku = idinku\nidin + ka = idinka\nidin + la = idinla\n\nTus.:\nRooble wax fiican ayuu ii sheegay\nWiilku in uu idiinla  hadlo ayuu doonayaa\nCali baabuurkiisi buu nagu  qaaday\nArbow buug buu kuu dhiibay\n Jeylaani baa kula socodsiinaya\nWuu noo keenay alaabta\n Horyaallada iyo magacuyaalka qoflaawe (la)\n\nla + u = loo\nla + ku = lagu\nla + ka = laga\nla + la = lala\n\nTus.:\nWaa lala hadli doona\nWaa loo sheegay\n\nHoryaallada  iyo magacuyaalka noqod (is)\n\nis + u = isu\nis + ku = isku\nis + ka = iska\nis + la = isla\n\nTus.:\nIska jir!\nIska warran!\nIsu gee!\nIsku dar!\nIsla qabta!\n"
    },
    {
      "page": 72,
      "text": "945 Magacuyaallo layeele iyo labo horyaale\n\n ugu uga ula kaga kula kala\ni iigu iiga iila igaga igula igala\nku kuugu  kaaga  kuula  kaaga kugula kaala\nna noogu  nooga  noola  nagaga nagula nagala\nina inoogu  inooga  inoola  inagaga inagula inagala\nidin idiinku  idiinka  idiinla  idinkaga idinkula idinkala\nla loogu  looga  loola lagaga lagula lagala\n\nTus.:\nArday kale ayaa fasalka noogu  timid\nMaamulihii baa saaka si faafahsan idinkaga  hadlayaa imtixaanka\nFatxiya ayaa buugga Axmed kaaga  qaadday\nCali meel cidla ah ayuu iigaga tagay\nGabadha si fiican baa loola  dhaqmay\nArrintaas mar hore ayaa looga digay\nWarkan buu noola  yimid\n"
    }
  ]
}